using System;
using System.Collections.Generic;
using System.Configuration;
using System.IO;
using System.Linq;
using System.Text;
using System.Threading.Tasks;
using System.Windows;
using System.Windows.Input;
using System.Windows.Media.Imaging;
using WeSplitApp.Model;
using WeSplitApp.Models;

namespace WeSplitApp.ViewModels
{
    public class DetailUCViewModel : BaseViewModel
    {
        //Properties
        private Journey _detailJourney;
        public Journey DetailJourney { get => _detailJourney; set { _detailJourney = value;

                // get member list who don't paticipate journey
                MemberList = new AsyncObservableCollection<Member>();
                foreach (var member in DataProvider.Ins.DB.Members)
                {
                    MemberList.Add(member);
                }
                foreach (var member in DetailJourney.Members)
                {
                    MemberList.Remove(member);
                }

                OnPropertyChanged(); } }

        private  AsyncObservableCollection<dynamic> _detailRouteList;
        public AsyncObservableCollection<dynamic> DetailRouteList { get => _detailRouteList; set { _detailRouteList = value; OnPropertyChanged(); } }

        private AsyncObservableCollection<dynamic> _detailMemberList;
        public AsyncObservableCollection<dynamic> DetailMemberList { get => _detailMemberList; set { _detailMemberList = value; OnPropertyChanged(); } }

        private AsyncObservableCollection<Member> _memberList;
        public AsyncObservableCollection<Member> MemberList { get => _memberList; set { _memberList = value; OnPropertyChanged(); } }

        private Member _selectedMember;
        public Member SelectedMember { get => _selectedMember; set { _selectedMember = value; OnPropertyChanged(); } }

        private string _startDate;
        public string StartDate { get => _startDate; set { _startDate = value;
                DataProvider.Ins.DB.Journeys.Find(DetailJourney.Id).Departure = Convert.ToDateTime(StartDate);
                DataProvider.Ins.DB.SaveChanges();
                OnPropertyChanged(); } }

        private string _endDate;
        public string EndDate { get => _endDate; set { _endDate = value;
                DataProvider.Ins.DB.Journeys.Find(DetailJourney.Id).Arrival = Convert.ToDateTime(EndDate);
                DataProvider.Ins.DB.SaveChanges();
                OnPropertyChanged(); } }

        private BitmapImage _cover;
        public BitmapImage Cover { get => _cover; set { _cover = value; OnPropertyChanged(); } }

        private string _routeName;
        public string RouteName { get => _routeName; set { _routeName = value; OnPropertyChanged(); } }

        private string _routeDescription;
        public string RouteDescription { get => _routeDescription; set { _routeDescription = value; OnPropertyChanged(); } }

        private string _addOrUpdateRouteContent;
        public string AddOrUpdateRouteContent { get => _addOrUpdateRouteContent; set { _addOrUpdateRouteContent = value; OnPropertyChanged(); } }

        private dynamic _selectedRoute;
        public dynamic SelectedRoute { get => _selectedRoute; set { _selectedRoute = value;
                if (SelectedRoute == null)
                {
                    RouteName = "";
                    RouteDescription = "";
                    AddOrUpdateRouteContent = "THÊM";
                }
                else
                {
                    RouteName = SelectedRoute.Name;
                    RouteDescription = SelectedRoute.Description;
                    AddOrUpdateRouteContent = "CẬP NHẬT";
                }
                OnPropertyChanged(); } }

        private dynamic _selectedTab;
        public dynamic SelectedTab { get => _selectedTab; set { _selectedTab = value;
                if (SelectedTab.Header == "Thời gian")
                {

                    // get cover
                    string x = "ÿØÿà\0\u0010JFIF\0\u0001\u0001\u0001\0`\0`\0\0ÿÛ\0C\0\u0003\u0002\u0002\u0003\u0002\u0002\u0003\u0003\u0003\u0003\u0004\u0003\u0003\u0004\u0005\b\u0005\u0005\u0004\u0004\u0005\n\a\a\u0006\b\f\n\f\f\v\n\v\v\r\u000e\u0012\u0010\r\u000e\u0011\u000e\v\v\u0010\u0016\u0010\u0011\u0013\u0014\u0015\u0015\u0015\f\u000f\u0017\u0018\u0016\u0014\u0018\u0012\u0014\u0015\u0014ÿÛ\0C\u0001\u0003\u0004\u0004\u0005\u0004\u0005\t\u0005\u0005\t\u0014\r\v\r\u0014\u0014\u0014\u0014\u0014\u0014\u0014\u0014\u0014\u0014\u0014\u0014\u0014\u0014\u0014\u0014\u0014\u0014\u0014\u0014\u0014\u0014\u0014\u0014\u0014\u0014\u0014\u0014\u0014\u0014\u0014\u0014\u0014\u0014\u0014\u0014\u0014\u0014\u0014\u0014\u0014\u0014\u0014\u0014\u0014\u0014\u0014\u0014\u0014\u0014ÿÀ\0\u0011\b\u0001à\u0001à\u0003\u0001\"\0\u0002\u0011\u0001\u0003\u0011\u0001ÿÄ\0\u001f\0\0\u0001\u0005\u0001\u0001\u0001\u0001\u0001\u0001\0\0\0\0\0\0\0\0\u0001\u0002\u0003\u0004\u0005\u0006\a\b\t\n\vÿÄ\0µ\u0010\0\u0002\u0001\u0003\u0003\u0002\u0004\u0003\u0005\u0005\u0004\u0004\0\0\u0001}\u0001\u0002\u0003\0\u0004\u0011\u0005\u0012!1A\u0006\u0013Qa\a\"q\u00142\u0081‘¡\b#B±Á\u0015RÑð$3br‚\t\n\u0016\u0017\u0018\u0019\u001a%&'()*456789:CDEFGHIJSTUVWXYZcdefghijstuvwxyzƒ„…†‡ˆ‰Š’“”•–—˜™š¢£¤¥¦§¨©ª²³´µ¶·¸¹ºÂÃÄÅÆÇÈÉÊÒÓÔÕÖ×ØÙÚáâãäåæçèéêñòóôõö÷øùúÿÄ\0\u001f\u0001\0\u0003\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\u0001\0\0\0\0\0\0\u0001\u0002\u0003\u0004\u0005\u0006\a\b\t\n\vÿÄ\0µ\u0011\0\u0002\u0001\u0002\u0004\u0004\u0003\u0004\a\u0005\u0004\u0004\0\u0001\u0002w\0\u0001\u0002\u0003\u0011\u0004\u0005!1\u0006\u0012AQ\aaq\u0013\"2\u0081\b\u0014B‘¡±Á\t#3Rð\u0015brÑ\n\u0016$4á%ñ\u0017\u0018\u0019\u001a&'()*56789:CDEFGHIJSTUVWXYZcdefghijstuvwxyz‚ƒ„…†‡ˆ‰Š’“”•–—˜™š¢£¤¥¦§¨©ª²³´µ¶·¸¹ºÂÃÄÅÆÇÈÉÊÒÓÔÕÖ×ØÙÚâãäåæçèéêòóôõö÷øùúÿÚ\0\f\u0003\u0001\0\u0002\u0011\u0003\u0011\0?\0üª¢Š(\0¢Š(\0¢Š(\0¢Š(\0¢Š(\0¢Š(\0¢Š(\0¢Š(\0¢Š(\0¢Š(\0¢Š(\0¢Š(\0¢µ¼7á\u001dwÆw²Ùø\u007fEÔuÛ¸¢3Éo¦ÚIq\"F\bRåP\u0012\u0017,£=2ÃÖ½\u001bÃ\u007f²_Åß\u0015X½Ý—\u0081µ\bbI\fEu'ŠÆMÀ\u0003‘\u001cîŒW\f>`0NFr\u000e\0<ŽŠúoCÿ\0‚yüRÕ´¸n®®<?¢Ï&íÖ7×²4Ñáˆ\u001bŒ1Hœ\u0081‘†<\u0011œ\u001c\u0081Ùxoþ\t§®]X»ëþ8ÓôÛÑ!\v\u000e›b÷‘˜ð0ÅÝâ!³¸mÚF\099À\0øÊŠû‹þ\u001d—ÿ\0U#ÿ\0(_ýÓGü;/þªGþP¿û¦€>\u001d¢¾âÿ\0‡eÿ\0ÕHÿ\0Ê\u0017ÿ\0tÑÿ\0\u000eËÿ\0ª‘ÿ\0”/þé \u000f‡h¯³|Iÿ\0\u0004ÓÖílQô\u000f\u001ciú\u009dç˜\u0003C©X½œb<\u001c°tyIlí\u001bv\u0081‚NF0xíkþ\tçñGJÒç»µ¹ðþ³<{vØÙ^È³K–\0í2Ä‰À%Žç\u001c\u0003Œœ\u0002\u0001ó\u001d\u0015ëž$ý’¾.øVÅ.ï|\r¨O\u0013È\"\v¦¼WÒn œ˜àw`¿)ùˆÀ8\u0019É\u0019ó\u008f\u0012xG]ðmôv^ Ñu\r\u000eòH„Éo©ZÉo#FIPá\\\u0002W*Ã=2§Ò€2¨¢Š\0(¢Š\0(¢Š\0(¢Š\0(¢Š\0(¢Š\0(¢Š\0(¢Š\0(¢Š\0(¢Š\0(¢Š\0(¢Š\0(¢Š\0(¢Š\0(¢Š\0(¢Š\0(¢Š\0(¢Š\0(¢Š\0(¢Š\0(¢Š\0(¯Qø[û3|EøÁdš‡‡¼>çF3G\tÕ/¥Kk|;:—Mä4ª†7ÞbW*@\u0004e”\u001f­~\u0016ÿ\0Á:ü9¡Í\u0015ïŽu‰|M/–¤évA­mUÊ0pÒ\u0006ó$\u0001Š•#ÊûŸ0 í\0\u001f\0XX\\ê—ÖöVVó^^\\È°Áon…ä–F **ŽY‰ \09$×¸ø\u0003ö%ø«ãÈRáôh¼3g$lé?ˆ%6ìJ¾Ý†\u0015V•XòFä\0\u0081œò¹ý*ðOÃ\u007f\v|8±6ž\u0018Ð4ý\u0012&Ž8¤k8\u0015$˜F\bC+ãtŒ2ß3’rÄç$×¢ø\u007fáïˆ|Q´Øis¼-Òy\a—\u001fýôØ\að \u000f…ü3ÿ\0\u0004×ðÍ¡ºÿ\0„‡ÆZ¶ª\u001boÙÿ\0³-¢²Ù×výþvìü¸ÆÜ`õÏ\u001eãáŸÙ_á/„¾Óö\u001f\u0002iSý£nÿ\0í4kümÎ6ý¡ŸgÞ9ÛŒñœàcëÍ\u0013öm½—kêÚ¬6ëÔÇh†CôÜp\aäk¼Ò~\u0006øKKÚd³“P\u0090\u007f\u001dÜ¤ÿ\0ã«\u0081úP\aËª¥˜\u0005\u0019' \u0002·4ß\u0002ø‡VÁ´Ño¥SÑü†Uÿ\0¾ˆÅ}q¦èzvŽ\u0081l,-¬×Ò\bU?\u0090«Ô\u0001òÕŸÀß\u0018]à¶\u009d\u001d²žó\\'ò\u0004šØ·ýœ|E&\f·ÚlCÐI#\u001fý\u0002¾\u008d¢€<\u000e\u001fÙ¦ù‡ïuËt?ì@ÍýEX_ÙšOâñ\u0012\u008f¥™?ûR½ÒŠ\0ð¦ý™¤þ\u001f\u0011)úÙ‘ÿ\0µ*\t¿f›å\u001fº×-Üÿ\0·\u0003/õ5ï”P\aÎW\u001f³\u008fˆ£ÉŠûM”z\u0019$Sÿ\0 V5çÀß\u0018Zd®\u009d\u001dÊŽðÜ'ò$\u001aúšŠ\0øçPð\u001fˆ´¼›­\u0012ú5\u001d\\@Ì¿÷Ð\u0004V\u001b+#\u0015`TŽ\b5÷\u0015QÔ´=;XB·ö\u0016×‹é<*ÿ\0ÌP\aæ¯‰¿e\u007f„Þ.û7Û¼\t¥Aö}Û?³\u0011¬3»\u0019Ýör›þèÆìãœc'>'ã/ø&ï…õK¤›Ã^+Ôt\u0018Ùäy`¾·Kä\0\u0090Qc!£e\vó\u000f˜¹9\u001cðsúÉ«|\rð–©¸¥œº|‡ø­%#ôl\u008fÒ¸Msöm»‹sé\u001a¬W\u0003¨Ší\n\u001f¦á\u0090\u007f!@\u001f‰^>ý‰~+x\u000e\u0017¸M\u0016/\u0013YÇ\u001a»Ï Jn\u0018\u0016}»\u0004,«30à\u009d¨@\a9á±á×Ö7:]õÅ•í¼¶—–ò43[Î…$‰Ô\u0090ÈÊy\f\b ƒÈ\"¿x¼AðïÄ^\u0019Ü×úTë\nõž!æG\u008fRË\u0090?\u001aó\u008f\u001aü7ð·Äk\u0011iâ}\u0003OÖâXäŠ6¼·W’\u0011 \u0001ÌRctlp¿2\u0010r ç P\aâí\u0015ú\rñKþ\t×áÍrio|\r¬Ká™|¶#K½\rujÎ\u0011B\u0005\u0090·™\u0018,\u0018³7›÷þP\u0002í?#üPý›>!ü †k¿\u0010x~_ì˜ät\u001a­“\v‹R¡Õ\u0003³.LJå×oš\u0010œã\u0019\u0004\0\u000f1¢Š(\0¢Š(\0¢Š(\0¢Š(\0¢Š(\0¢Š(\0¢Š(\0¢Š(\0¢Š(\0¢Š(\0¢Š(\0¢Š(\0¢Š(\0¢Š(\0¢Š(\0¢Š(\0¢º?‡ÿ\0\u000e|IñKÄI¡ø[J—WÔÚ7˜Ã\u001b**F£ægw!Pr\u0006XŒ–P9 \u001f¾~\rþÀ^\u0011ðYµÔ¼eqÿ\0\t~®\u0081$û\u0019S\u001eŸ\v\u008dŒFÌî›k+Œ¹\bêß4@Ð\aÇ\u001f\b¿fO\u001fühòî4=#ìš;gþ':™0Zq¼|­‚Ò|Ñ”>Z¶Ö#vÑÍ}Çð‹ö\u0017ð\aÃŸ.ó[‹þ\u0013}asûÝR\u0010-\u0013ï\u008f–Û,§*ëŸ0Éó eÚké\u008d'G¼Ö¯#²Ó­dº¸n\u0016(W'\u001fÐ{ô¯dðoìîÍåÜøŽçhëö\u001bVçèÏý\u0017ó \u000f\u001aÓ4›Íféml-f»\u009dºG\n\u0016?^;WªxcövÔï‚M­]¦\u009d\u0011äÁ\u000e$—èOÝ\u001f­{®\u008d iÞ\u001eµ\u0016úm”6P÷X\u0090\u0002Þäõ'ÜÖ…\0r~\u001bø]á¯\vª›]69§_ùxº\u001el™õ\u0004ð?\0+¬¢Š\0(¢Š\0(¢Š\0(¢Š\0(¢Š\0(¢Š\0(¢Š\0(¢Š\0(¢Š\0+”ñ'Âÿ\0\rø¤3]éÑÅpßòñkû¹3êHàþ ×WE\0|÷â\u008fÙ×Q±\u000f6‰všŒC‘o>#—è\u000fÝ?¥y^©¤Þh×Mk\u007fk-¤ëÖ9\u0090©úóÔWÛ\u0015CYÐtï\u0010Ú\u001bmJÎ\u001bÈOðÊ¹Ç¸=A÷\u0014\u0001ù=ñwö\u0017ð\aÄo2óC‹þ\u0010\u008da±ûÝ2\u0010m\u001fî\u000fšÛ!F\u0015\u001b\u001eY\u008færÍº¾\u001cø½û2xÿ\0à¶û\u008dsIû^Ž¸ÿ\0‰Î˜Löœì\u001f3`4\u007f4\u0081\a˜«¹\u0081Û¸\f×ï\aŒ¿gr<ËŸ\u000e\\ç¿Ø®›ôWþ\u008dù×\u008dêšEöƒ|Ö·ö²ÙÜ§%%R§ê=G¸ \u000fÂê+ôsã\u001fì\u0003á\u001f\u0019ý«RðmÁð†°áäû\u0018S&Ÿ3Ÿ1±³;¡Üìƒ(J\"¯Ë\u00115ð7\u008f¾\u001dx\u008fáwˆŸCñN•.‘©¬k0†FWW\u008d‡\u000eŽ„«¯\u0004eI\0«\u0003È \0s”QE\0\u0014QE\0\u0014QE\0\u0014QE\0\u0014QE\0\u0014QE\0\u0014QE\0\u0014QE\0\u0014QE\0\u0014QE\0\u0014QE\0\u0014QE\0\u0014QSØØÜê—ÖöVVòÞ^\\È°Áo\u0002\u0017’Y\u0018€¨ª9f$€\0ä“@\u0010WÒß³ïìIâOŠðÚk¾$’_\vøRâ(îmåÚ\u008fu\u007f\u0019|\u0011\u001a\u0016ýÐ(¬DŽ?Š6Tul\u008fzý\u009d?a]#ÁqØø‹ÇËoâ\rnk\\\u009d\u0002âÝ$³°•™\u0081\fw2Ü6Íœ\u0090\u0015X¾\u0003á$¯²¼9á\u008dKÅš‚Ùi–­q1åˆáPz±è\u0005\0pþ\0øsáÏ…þ\u001eM\vÂÚTZN˜²´ÞLlÎÏ#\u001eY\u009dÉgn\0Ë\u0012@U\u0003€\0÷_\0ü\vÔ|EåÞk&M/O<ˆñ‰ä\u001eÀýÑî\u007f*ôï‡¿\a4Ï\u0006¬wwa5\u001d[¯œëòD\u007fØ\aÿ\0B<ý+Ðè\u0003'Ã¾\u0015Ò¼'f-´»8ícþ&Q—sêÌy?\u008dkQE\0\u0014QE\0\u0014QE\0\u0014QE\0\u0014QE\0\u0014QE\0\u0014QE\0\u0014QE\0\u0014QE\0\u0014QE\0\u0014QE\0\u0014QE\0\u0014QE\0\u0015“â/\vi~+²6º¥œwQÿ\0\v0Ã¡õV\u001cƒô­j(\u0003æÿ\0\u001e|\tÔ|>$¼Ñ‹ê–\u0003“\u001e?\u007f\u0018ú\u000f¼=Ç>Õá?\u0010>\u001cøsâ‡‡dÐ¼S¥E«i\u008d\"ÍäÈÌŒ’)áÑÔ†FäŒ©\u0004†`x$\u001fÐjóßˆ_\atÏ\u0019,—v¡tí[¯œ«òJ}\u001c\u000fý\bsõé@\u001f…ß´'ìMâ?„ÐÝkž\u001c’o\u0014xR\u0018ä¸¸›b¥Í‚\aàH€þñB\u0015&D\0|²\u0016TP\tùª¿v¼Iá\u008dKÂz‹YjvÍo0å[ª¸þòžâ¾0ý¤¿a\u008d?Æ\u008d7ˆ~\u001eCg¡jñÁ‰4(¢Xm/\u0019@\ncÆ\u0016\u0017*\b<lc´\u009d‡{°\aç¥\u0015=ý\u008dÎ—}qe{o-\u009då´\u008d\fö÷\bRH¤RC#)åX\u0010A\a\u0090EA@\u0005\u0014Q@\u0005\u0014Q@\u0005\u0014Q@\u0005\u0014Q@\u0005\u0014Q@\u0005\u0014Q@\u0005\u0014Q@\u0005\u0014Q@\u0005\u0014Q@\u0005\u0014WUðÇáŽ¿ñwÆ\u0016ž\u001bðå§Úo§ùÞI\tXmâ\u0004n–VÁÚ‹‘Ï$’\u0014\u0002Ì\u0001\0Ïð\u007f‚µßˆ\u001aì\u001a7‡4«\u009dcR˜€°Z¦í °]îz\"\u0002Ã.Ä(ÎI\u0002¿P?fŸÙ—Gø\aáÑ,Â\rSÅ÷ˆ>Ýª„ÈŒ\u007fÏ\b\t\u0019XÇsÁr2Ø\u0001U:_\u0081\u007f\u0002ü?ð\u001fÁé£èéö›é¶É¨êÒ&Ù¯e\u0019Á#'j.HT\a\n\têÌÌßJ|+ø?7‹š=OT\u000fo£ƒ•N\u008fqŽÃÑ}ÿ\0/P\u0001\u008dðïá~£ãË\u0081(Í¦–\u008d‰nØuõT\u001dÏè;úWÒþ\u0019ð¶›á\u001d1,tËq\fC–cËÈßÞcÜÖ…••¾›i\u0015­¬)oo\u0012íHã\\*\u008f@*z\0(¢Š\0(¢Š\0(¢Š\0(¢Š\0(¢Š\0(¢Š\0(¢Š\0(¢Š\0(¢Š\0(¢Š\0(¢Š\0(¢Š\0(¢Š\0(¢Š\0(¢Š\0(¢Š\0Éñ7…´ß\u0017i¯c©Û‰¢<«txÛûÊ{\u001aùŸâ'ÂýGÀw\u001eiÍÞ—#b+µ\u001d?ÙqØþ‡ô¯«ª\u001bË85\vYm®¡Iíå]¯\u001cƒ*Àö\"€?.ÿ\0iÏÙ¿Mý¡<7\v\tRÃÅšd&=/R“%Bngû<¸É1\u0016fn\u0001(ÌYAË«þ`øÛáÿ\0‰>\u001bë?Ù^(Ñ/t+öV’8ï!(&ŒHñù‘7Ý’2ñº‡BT”8'\u0015ûéñSàüÞ\u0012i5=)^ãG'.\u009d^Ûëê¾ÿ\0Ÿ©ù¯ã§Àí\u0003ãÏƒ[EÖ\u0017ì×\u0090\u0016—NÕ\"@ÒÙL@\u0004Ž›‘°¡Ó 0\u0003\u0090Ê¬ \u001f\u008fôWUñ7á—ˆ>\u0011ø¾ïÃž#´û5ô\u001f2H„´W\u0011\u0012vË\u0013`nFÁç‚\b €À\u0081ÊÐ\u0001E\u0014P\u0001E\u0014P\u0001E\u0014P\u0001E\u0014P\u0001E\u0014P\u0001E\u0014P\u0001E\u0014P\u0001E\u0015=…\u008dÎ©}oeeo-ååÌ‹\f\u0016öè^Idb\u0002¢¨å˜’\0\u0003’M\0lü?ðN£ñ#ÆÚ'…ô­‹\u007fªÝÇk\u001c²¤\u008d\u001c!\u008fÍ,žZ³\bÑrìUI\n¬pq_«ß\u0002¾\u0005è?\u0001¼\u001eº>\u0090¢êúr$ÔuY#\v5ä \u001c\u0013ÉÚ‹’\u0015\u0001!A=Y™›Ÿý›ÿ\0f=\u001fö{Ñe-5¾³âËÅÙ\u007f¬Ä­åíÎ|›}ê\u0019bÈ\a$\u0006r\u00030\u0018TO­~\u000fü+>.¸\u001a®§\u001b.\u008f\v|¨xûC\u000eßîŽçðõÀ\u0005¯„_\bO‰\u001a=cY\u008d“KS˜`n\rÁ\u001dÏû\u001fÎ¾‰Ž4†5Ž5TE\u0001UT`\0:\0(Ž4†5Ž5TE\u0001UT`\0:\0)Ô\0QE\u0014\0QE\u0014\0QE\u0014\0QE\u0014\0QE\u0014\0QE\u0014\0QE\u0014\0QE\u0014\0QE\u0014\0QE\u0014\0QE\u0014\0QE\u0014\0QE\u0014\0QE\u0014\0QE\u0014\0QE\u0014\0QE\u0014\0QE\u0014\0Ù#I£häUt`U•†A\a¨\"¾vø½ðˆøq¤ÖthÙ´¶9šÝy6ä÷\u001fì\u007f/¥}\u0017M’5š6GUt`U•†A\a¨\"€?5þ:|\vðÿ\0Ç\u008f\b¶‘¬)¶¾ƒtšv«\n\u00035œ¤u\u0019ûÈp7Ç\u0090\u0018\u0001È`¬¿“~5ð~§ðÿ\0Åš¯‡5˜\r¾¥¦Ü5¼Ëµ€ltuÜ\u0001(Ã\f­ŽU\u0081èk÷çã\aÂ³á\u001b“ªé‘³hó7ÌƒŸ³±íþéì\u007f\u000fLü‰ûN~Í:WÇ¿\r\u0019á\u0011ØxÂÂ\"4íG\u0018\u0012\u000eOÙæõŒ’pz£\u0012Ã‚êà\u001f”ôT÷Ö7:]õÅ•í¼¶—–ò43[Î…$ŠE$22žU\u0081\u0004\u0010y\u0004T\u0014\0QE\u0014\0QE\u0014\0QE\u0014\0QE\u0014\0QE\u0014\0QE\u0014\0WèWì/û6Ÿ\u0006èðüDñ\f6Òêúµ²I¤C\u008díglêO›»8\u000f*°à\fªpN]Õ|+ö$ýŸcø±ãi<G®ÙÃuá=\u0006AæZÝÂí\u001dýÃ+\u0014Œ\u0011…\"3¶G\u0004ž±©R²\u001c~¢øcÃ—~,Öí´Ë%ÌÓ6\v\u0011Â/v>ÀP\aAð¿áÜÞ<Ö± h´»r\u001aæeã>ˆ§ÔþƒŸJú¢ÎÎ\r>Ò\u001b[h–\vxT$q ÀU\u001d\0¬ï\vxfÏÂ:%¾™b˜Š!–s÷¤cÕ›Üÿ\0õ«^€\n(¢€\n(¢€\n(¢€\n(¢€\n(¢€\n(¢€\n(¢€\n(¢€\n(¢€\n(¢€\n(¢€\n(¢€\n(¢€\n(¢€\n(¢€\n(¢€\n(¢€\n(¢€\n(¢€\n(¢€ ¼³ƒQ´šÖæ%žÞe)$n2\u0019OPkå\u008fŠ?\u000eæð\u001eµˆƒI¥Ü\u0012ÖÓ\u001eHõF÷\u001f¨ç×\u001fWVOŠ|3gâí\u0012ãL¾LÅ(ù\\\u000fš6\u001d\u0019}Çÿ\0Z€?\u001e\u007fn\u007fÙ´øÓG›â\u001f‡¡µ‹WÒm^M^\u001c\bÚòÖ5Ï›» \u0019\"U<\u001eY0\u0001Ê\"·ç\u009d~íxŸÃ—~\u0013ÖîtËÕÄÐ·\f>ë¯f\u001eÄWå×íµû=Çð›Æ‘ø\u008fBµŠÛÂšô\u008dåÚÚÂë\u001d…Âª—ˆžT+üÎ€\u0011À‘B…Œ\u0012\u0001óU\u0014Q@\u0005\u0014Q@\u0005\u0014Q@\u0005\u0014Q@\u0005\u0014Q@\u0005t\u007f\u000e~\u001fêÿ\0\u0014¼m¥x[CH_SÔd)\u0019¸\u0090G\u001a*©wvoEEf8\u0004œ`\u0002p\u000f9_£Ÿ°\u000fÁÃà¿‡w\u001e2Ô­Dz¿‰0m¼Ø±$6(NÌ\u0016@Ëæ¶\\áŠº,\rÔP\aÐß\u000e|\u0001¤ü/ð^“á]\t&]3NŒÇ\u0017Ÿ!’Gfbîì\u007f¼ÎÌÇ\0\0[\0\u0001€>Äø;ðôx7C\u0017wqãV½PÒî\u001cÄ\u009dD\u007fÔûý\u0005y‡À¯\u0001\u000f\u0010ëGY¼\u008fvŸ`ãËV\u001cI7P>‹ÁúãÞ¾‘ \u0002Š( \u0002Š( \u0002Š( \u0002Š( \u0002Š( \u0002Š( \u0002Š( \u0002Š( \u0002Š( \u0002Š( \u0002Š( \u0002Š( \u0002Š( \u0002Š( \u0002Š( \u0002Š( \u0002Š( \u0002Š( \u0002Š( \u0002Š( \u0002Š( \u0002Š( \u000f=øÅðôxËC7v‘çV²RÑm\u001cÊ\u009dL\u007fÔ{ýM|wñ\u001báþ“ñCÁz·…µÔ•´ÝB1\u001cžD†9\u0011•ƒ£©þòº«\f‚\t\\\u0010FAý\u0006¯›¾:x\vþ\u0011Ýhk\u0016qíÓïÜïU\u001cG7R>\u008dÉ\u001eù \u000fÀ¿ˆÞ\0Õ¾\u0016øÛUð¶¸‘&§§H\u0012Co'™\u001b«(tu?Ýdea\u0090\b\r‚\u0001È\u001cå~\u008dþß¿\u0006ÿ\0á3øw\aŒôÛ_3Yðæ~ÓåG—šÅ\u008fÏ\u009d¨Y¼¦ÃŒ°TC;\u001eµùÉ@\u0005\u0014Q@\u0005\u0014Q@\u0005\u0014Q@\u0005\u0014Q@\u001e«û2|#ÿ\0…Ññ\u007fHÐî#ß£Ûæÿ\0Tç\u0019µŒ®äáÕ¾vd\u008f*w/™»\u001f)¯×½\u001bI¸Öµ+M:Î=óÜ8Š5\u001d9þ@\u007f!_3~Âÿ\0\b\u007fá\\ü!\u008f\\¼\u008fn±âŸ.þO›;-@?fN\u001d”å]¤Î\u0015¿}µ†R¾þý\u009dü\u001b¹®|Grœ\fÛÚd\u007fßn?ô\u001fûê€=wÂ¾\u001d¶ð¦ƒg¥Ú\u008fÝÀ˜/Œ\u0017cË1÷'&µ¨¢€\n(¢€\n(¢€\n(¢€\n(¢€\n(¢€\n(¢€\n(¢€\n(¢€\n(¢€\n(¢€\n(¢€\n(¢€\n(¢€\n(¢€\n(¢€\n(¢€\n(¢€\n(¢€\n(¢€\n(¢€\n(¢€\n(¢€\nÉñW‡m¼Y ^iwC\u0011Î˜WÆJ0åX{ƒŠÖ¢€>'Ö4™ô]JïN¼\u008fdöîÑH§§\u001fÌ\u001fäkò\u0013ö›øCÿ\0\n[âö­¡ÛÇ³G¸Åþ—ógý\u0016BÛS—fù\u0019^<±ÜÞ^ìa…~ð~Ñ\u001e\rÚÖÞ#¶O½‹{½£¿ð9ÿ\0Ð\u007fïšø\aöèøEÿ\0\v\u001bá\u0004šåœ{µ\u008f\vy—ñó\u008dö¤\u000f´§.\u0014aQdÎ\u0018þçj\u008fž€?2(¢Š\0(¢Š\0(¢Š\0+Ô¿f_…Öß\u0018>4x\u007fÃúŒw\r£o{½@Á\u0003H<ˆ\u0090¾Ç*ècY\u0018$>fàTÊ\b\fp§Ëkô\u001bþ\t×ð¾M\u000fÁ:ÏŽ/a‹Í×$\u0016¶\fÑ¡‘máf\u00122È\u0018°W—*P…æÝ[\u0090W\0\u001fei:dúÎ§kal»§¸‘bAîN?*û'AÑàðö‹g¦Û\fCm\u0012Æ§\u001dqÔŸrr\u007f\u001að¯ÙÛÂâû\\»ÖæLÅdžT$\u008fùhÃ’>‹ŸûèWÐ”\0QE\u0014\0QE\u0014\0QE\u0014\0QE\u0014\0QE\u0014\0QE\u0014\0QE\u0014\0QE\u0014\0QE\u0014\0QE\u0014\0QE\u0014\0QE\u0014\0QE\u0014\0QE\u0014\0QE\u0014\0QE\u0014\0QE\u0014\0QE\u0014\0QE\u0014\0QE\u0014\0QE\u0014\0QE\u0014\0QE\u0014\0QE\u0014\u0001Ÿ¯hÐx‹E½ÓnFa¹ˆÆN:g£\u000fpp\u007f\nøßVÓ'Ñµ;«\v•Ùqo#DãÜ\u001c~UöÅ|÷ûEx`Xë–šÜ)ˆïSÊ˜\u008fùè£‚~«\u008fûäÐ\aágí1ð¶ßà÷Æm\u007fÃÚzÜ\r\u001ftwz{\\@Ñ\u0003\f¨\u001fb\u0016f2,l^\u001f3qÜb$…9QåÕú\rÿ\0\u0005\u0016øc&·à\u009d\u0017ÆöpÅæèr›KöX\u0090HÖó2ˆÙ¤$1T”\u0005\b\u0001æá\u008f\u0018lþ|Ð\u0001E\u0014P\u0001E\u0014P\u0004ö67:¥õ½••¼·w—\u0012,0ÛÀ…ä•Ø€¨ª9,I\0\u0001É&¿fþ\u001cx*ÛáÏ€´\u000f\fZ\u0018ž-*Ê+S40\b\u0016gU\u001bå(\tÃ;îsÉ9bI'šüÕý‰|\u0001\u001f\u008f?h\r\u0019î\u0012\u0019lô8ßYš9$tbb*°”ÛÕ–i!l\u0012\u0001\nÙÏÝ?®\u001f\u000eü?ÿ\0\t?Œô»\u0006]Ð´¢IGo-~f\u001fˆ\u0018üh\u0003é_…Þ\u001b\u001e\u0017ðN›jË¶âDûDþ»ß’\u000fÐa\u007f\nêè¢€\n(¢€\n(¢€\n(¢€\n(¢€\n(¢€\n(¢€\n(¢€\n(¢€\n(¢€\n(¢€\n(¢€\n(¢€\n(¢€\n(¢€\n(¢€\n(¢€\n(¢€\n(¢€\n(¢€\n(¢€\n(¢€\n(¢€\n(¢€\n(¢€\näþ)xlx£Á\u001a•ª®ëˆ“í\u0010zïNp>£+ø×YE\0~|üHðU·Ä\u007f\0ëþ\u0018»0¤Z¥”¶«4Ð\t–\u0019\u0019O—.ÂFY\u001fkŽAÊ‚\b<×ã%õ\u008dÎ—}qe{o-¥å¼\u008d\fÖó¡I\"u$22žC\u0002\b ò\b¯Þ\u001fˆž\u001fÿ\0„cÆz¥‚®ØVRñ\u000eÞ[|Ê?\0qøWä\u007fíµà\u0018ü\aû@k/n‘Eg®FšÌ1Ç#»\u0006”²Ì_wFi£™°\t\02ã\u001ft\0x=\u0014Q@\u0005\u0014Q@\u001f ŸðMß\u0006Ï¥ø\u000fÅ^&™äXõ{è­!…á*\n[£\u0013*¹?0f\u009d—\u0081Áˆòs\u0081úSû6è~n£ªêî¼C\u001aÛFO«\u001dÍù\u0005_ûê¾Bý•ü3ÿ\0\b\u008fìóàK\u001f´ý¯ÍÓ–ÿ\0Ìòöcí,×\u001b1“÷|í¹ï·8\u0019Àûçàn“ý—ðòÉÊí’òG¹oÄí_üuV€;ú(¢€\n(¢€\n(¢€\n(¢€\n(¢€\n(¢€\n(¢€\n(®gÄ\u001f\u0014<\u001bá;ƒ\u0006¹âÝ\u000fF\u009dzÅ¨jPÀÃðv\u0006€:j+\u0003Ã¿\u0010</ã\u0006+ ø“HÖØ\f•Ó¯¢¸ \u007fÀ\u0018Öý\0\u0014QE\0\u0014QE\0\u0014QE\0\u0014QE\0\u0014QE\0\u0014QE\0\u0014QE\0\u0014QE\0\u0014QE\0\u0014V~µâ\u001d+Ãv¿iÕµ;=.ß§\u009d{:BŸ›\u0010+—‹ã§Ãiæòcø…áY&Î<µÖ­‹~[è\u0003¸¢«Øê\u0016º¥ª\\Ù\\Ãynÿ\0vh$\u000e\u008dô àÕŠ\0(¢Š\0(¢Š\0(¢Š\0(¢Š\0(¢Š\0(¢Š\0ð?ÚKCòµ-+VEâhÚÚB=Tî_Ì1ÿ\0¾kósþ\n9à\u001bÝsÀ\u001e\u001cñ]¤w\u0013Ã ÝI\u0005âClÎ±Cq°\t¤\u0090\u007f«Q$QÆ20Zu\u0019\a\u0001¿Wþ9é?ÚŸ\u000f/$\vºK9\u0012å\u007f\u0003´ÿ\0ã¬\u007f*ø\u001fö¨ðÏü%ß³ÏŽì~ÓöO+Nkÿ\03ËßŸ³2ÜlÆGÞòvç¶ìàã\u0004\u0003ò>Š( \u0002µ¼#á»Ÿ\u0019x¯Eðýœ°Áw«^Ãa\f—\u0005„hòÈ¨¥Ê‚B‚Ã8\u0004ã±¬šõÏÙ+ÃvÞ*ý£<\revóG\u0014W­|¦\u0016\u0001¼Ëxžâ0r\u000fÊ^%\a¹\u0004àƒÈ\0ýjU,ÁTd“€\u0005}©¡é«£è¶\u0016\n0¶Ð$#þ\u0002 \u007fJù\u001fÀº\u007fö·Œô[R2²]Ç¸\u007f²\u0018\u0016ý\u0001¯±¨\0¢Š(\0¢Š(\0¢Š(\0¢Š(\u0003ó\u001fþ\nsÿ\0%ëAÿ\0±jßÿ\0J®«¨ÿ\0‚uüh¸ð\u008f‹µO…> gµKÉ¤›OŽãå0^ ÄÐ\u0010znUÎ?¼„ujåÿ\0à§?ò^´\u001fû\u0016­ÿ\0ôªêµÿ\0oß„W¿\v~(i_\u0015<3¾Æ\rNé$šh\u0006>Ë¨Çó,žÞ`]ßï#“Ö€?HkÀ¿o\u000fù5/\u001c\u007fÛ\u008fþ—[×uð\vâí—Æÿ\0…š7Š­vGq<~Mõº\u001fõ\u0017I\u0081\"}3ó\fõVSÞ¸_ÛÃþMKÇ\u001föãÿ\0¥Öô\u0001Àÿ\0Á1¿ä‚ëßö2Ü\u007fé-­}muu\r•´·\u0017\u0012¤\u0016ð¡’Id`ªŠ\u0006K\u0012z\0;×É?ðLoù º÷ýŒ·\u001fúKk[¿ðP¿‰\u0013ø\u001fà,º]”¦+Ï\u0011Ý®œÌ§\f-ö—›ð!B\u001fi\r\0x'Å¯Úcâ\u0017íEñ\u0019¾\u001e|!7V:\u00133Fnm\\Ã-ÜjpóË/X¡ôQ‚A\u0019É`£¹ðoü\u0012ÿ\0A[\u0014“Æ\u001e1Ôïu\u0017\u001b¥M\u0019#†5cÔ\u0006•\\¿Ô…Ï¥v\u007fðNß„ö¾\rø2¾,š\u0005:Ï‰¥yLÄ|Ék\u001b”Ž1è\tV~:ï\\ô\u0015õm\0|#ãÏø&\\zm«j\u001f\u000f<c{\u0016«oûÈmõ\u008d£{\u000eFÙâ\v°ú\u001d‡ê:Õ_ÙŸö¼ñ_\u0081||>\u0016übk\u0081:Î, Õ5\u0003þ‘k1ÀXç\u007fùi\u001bdbBI\u001b\u0081$©Êýñ_\n\u007fÁM~\u0013ÚÉ¢h\u001f\u0010ìàXï¡œiwìƒ™cef…ÛýÒ¬¹ëó¨ì(\u0003îº+È?d¿‰\u0013üRø\u0003áMföS>¥\u001c\rcy#\u001c³Ë\v\u0018÷±õeUsþõzý\0\u0015à_·‡üš—Ž?íÇÿ\0K­ëßkÀ¿o\u000fù5/\u001c\u007fÛ\u008fþ—[Ð\a\u0003ÿ\0\u0004Æÿ\0’\v¯\u007fØËqÿ\0¤¶µïŸ´\u0017ü\u0090_‰?ö-j_úK%x\u001fü\u0013\u001bþH.½ÿ\0c-Çþ’Ú×¾~Ð_òA~$ÿ\0Øµ©\u007fé,”\u0001ø¹c§ê\u0011iòë–«$vö7PB×Qœ\u0018¦\u0090Hñ`ö$C!\u001fî×í\u001fÀo‰‘|_øGá¯\u0015#)¸½µQv«Ñ.\u0013ä™qØoVÇ±\u0015ùéû\"|-\u001f\u0018¾\nütðìq\t5\u0016ƒLºÓøä\\Åö·Œ\u000fMÄ\u0014>ÎkÒ¿à™\u001f\u0014Í½ï‰~\u001dßJWÌ\u001fÚÖ\bç\u0018qµ'Ažäym\u008fö\\Ð\aè\u0005|\u0013ÿ\0\u00058ø©¶\u001f\rü<³›—?ÚÚ‚©ì7$\b\u007f\u001f5ˆöC_xÝ]Cck5ÍÄ‹\f\u0010¡’I\u001cáQ@É$ö\0WåÏÂûY¿k\u007fÛR]vî6›DŽõµYc\u0090p–VåV\bØ\u007fµˆP\u008fö˜Ð\u0006\aìS£Ýø{öÆð¶•\u007f\t·¾±¸Ô­n!n©\"YÜ«)ú\u0010E~µWæ?Á\u001fùI>£ÿ\0c/ˆ?ô]å~œP\u0001_˜ß·\u007fŒu\u000fŒŸ´^™à-\u0001\u001aüèþ^™mo\u0019\u0018’öb¦L\u001eƒ\u001f»Cž†3_¢\u007f\u0013<uiðÏáÿ\0ˆ<S}ƒo¥YÉs°œyŒ\aÈƒÝ›j\u008fv¯ÏÏø'¿\u0081nþ&|q×þ\"ëYº:H’äÏ ÿ\0Y}r[æ÷Â™O±*h\u0003{þ\t›ñ5ôŸ\u0012x›áÞ í\u0010¼_í+8¤à¬ñá&L\u007fx¦Ã\u008fúdkô.¿.¿h\u008d6çö^ý²­|]¦ÂÉ§]]Ç®À‘ð\u001e9\u0018­ÔC°Éó†;\aZý;Ó5+mgM´Ô,¦[‹;¨RxfOºñ²†V\u001eÄ\u0010h\u0002Õ|wû\\þÙZ\u008f\u0081üAÿ\0\nïá¼\u007fmñ„¬°Ý_G\u0017œmd|m†$Á\u000f1ÈÎA\v\u00900[;~šø«ãdøoð×ÄÞ'uW:VŸ5Ôq·G‘Pì_Å¶\u008fÆ¾\u0013ÿ\0‚qü>ÿ\0„óâGŠ¾#ëÙÔ/4ÖÛ\u0004×\u001f1k»‚í,ßï\u0005\u0004\u007fÛ\\Ð\u0006·ƒ?àž¾0ø–Éâ/‹>6¼ƒSº\u0001ÞÎ67—J\u000f8y\u009dŠ©\u001fÝPÀzö®îçþ\t…ðé­JÛø›Å\u0011\\c‰$–ÙÓ?îˆAýkìZ(\u0003ó‡Æ\u001f±\u008fÅÿ\0ÙæY¼Gð¿ÅWšÍ´?¼–-,µµáQÏÍ\u0006æY€ô\u0004“ýÚû+ö]ø\u0081­üRø\u0013á\u008f\u0012ø\u0090ÆÚÝØ¹Žå¢‹Ê\u0005¢¹–\u0010Jv$F3Œ\fç\0t¯T¨­ía³ŒÇ\u00041Â…ÚB±¨PY˜³6\arÄ’{’M\0|“ÿ\0\u00059ÿ\0’\v ÿ\0ØËoÿ\0¤·Uà_\u0001ÿ\0`\u001fø]Ÿ\nt?\u001a\u007fÂwý\u008dý§çÿ\0 ÿ\0cùþ_—<‘}ÿ\0=sŸ/?tc8íš÷ßø)Ïü\u0090]\aþÆ[\u007fý%º®ûö\u000fÿ\0“Rð?ý¿\u007féuÅ\0x\u0017ü:³þª\u007fþ[ÿ\0ýÕ]\aÃïø&¿ü ž=ð×‰\u007fábý»û\u001bS¶Ô~Ëý‡åùÞL«&Íßh;s·\u0019ÁÆz\u001aûjŠ\0(¢Š\0(¢Š\0(¢Š\0(¢Š\0£®i«¬h·ö\f2·0I\tÿ\0\u0081)\u001fÖ¾*t ²0ç¡\u0006¾ã¯Ž|u§\u007fdøËZµ\u0003\v\u001dÜ›Gû%‰_ÐŠ\0ü3ñw†î|\u0019âÍkÃ÷’Ã=Þ“{5„ÒÛ–1;Å##\u0014,\u0001*Jœd\u0003ŽÂ²k×?kO\rÛxWöŒñÍ•¤’É\u0014·«|Zb\vo¸‰.\u001c\f\u0001ÀyX\u000eø\u0003$žkÈè\0¯¦ÿ\0àžz\u001d–­ñî{«¨|ÙôÍ\u001aâîÑ·0òå2E\tl\u0003Ïîæ\u0090`ä|Ùê\u0001\u001f2WÙ¿ðMO\rÛ]x«ÆúûI(¼±²¶±Ž5#Ë)<ŽîHÆw\u0003l˜ÁÆ\vd\u001e0\u0001úmð6Ïí\u007f\u00124æ#+\u0002K)ÿ\0¾\b\u001f«\nú–¾sýœmüÏ\u0019ßJFDv,\aÔÈŸÐ\u001aú2€\n(¢€\n(¢€\n(¢€\n(¢€?1ÿ\0à§?ò^´\u001fû\u0016­ÿ\0ôªê¿Aþ/|3Ó~0|9Öü'ª\0°j\u0010\u0015Žm¹0J9ŽQî¬\u0001÷Á\u001dëóãþ\nsÿ\0%ëAÿ\0±jßÿ\0J®«ôâ€?3?b¿‰š—ìûñßUøiâ²l¬µ[¿ìù£‘¾H/Ð•‰ÁþëýÌŽ»£=\u0005}mûx\u007fÉ©xãþÜ\u007fôºÞ¼\u0013þ\nEð5¢“Oø©£BÈêc²Ö\fC\u0004\u0011Ä\u0013’?\bÉÿ\0®u¡ãoŽKñÓþ\téâ\u009dBêe\u007f\u0010é¿`°ÕW?1•omöË\u008fI\u0017\ré»p\u001d(\u0003­ÿ\0‚c\u007fÉ\u0005×¿ìe¸ÿ\0Ò[Záÿ\0àª\u0013H¶\u007f\ra\u0019òšMEÛýà-€ÿ\0Ðš»\u008fø&7ü\u0090]{þÆ[\u008fý%µªÿ\0ðS?\u0005Í­|!Ð¼C\u0004fOìMKlä\u000f¹\fë´±ÿ\0\u0081¬Cþ\u0005@\u001eùû7C\u001d¿ìýðábÆÓáû\u00178\u001fÄÐ!oÔšôzùÿ\0ö\u0017ñä\u001e8ýœ|9\u0012Ê\u001eóEß¥]'t1œÇø\u0018š3ùúWÐ\u0014\0WÏ?·Ô1Ëû,ø±¤Æèå²xóýïµÄ?‘5ô5|ƒÿ\0\u0005,ñä\u001a\u001fÁÝ/Ã\v/úv»¨+˜¿éÞ\u0001½›þû0þ¾”\u0001gþ\t›4’þÏúª¾vÇâ\u001b…O÷~Ïn\u007f™5õ­|÷û\aø.o\u0006þÍž\u001ek˜ÌW\u001a¼“jŒŒ?†FÄgñ\u008d#oÆ¾„ \u0002¼\vöðÿ\0“RñÇý¸ÿ\0éu½{íx\u0017íáÿ\0&¥ã\u008fûqÿ\0Òëz\0à\u007fà˜ßòAuïû\u0019n?ô–Ö½óö‚ÿ\0’\vñ'þÅ­Kÿ\0Id¯\u0003ÿ\0‚c\u007fÉ\u0005×¿ìe¸ÿ\0Ò[Z÷ÏÚ\vþH/ÄŸû\u0016µ/ý%’€>Dÿ\0‚V\u007fÍOÿ\0¸_þÝ×˜|p°¸ý”\u007flë\u007f\u0013éñ4zL÷‰­A\u001cc\u0001íæ,·1\u000eÃ“2\u0081Ø\u0015¯Oÿ\0‚V\u007fÍOÿ\0¸_þÝ×¢\u007fÁG¾\u0015ÿ\0Âað†ÓÅ–\u0090ïÔ<3q¾R£“k)T\u0090{áÄmì\u0003P\u0006ÿ\0íÍñ’ßÁ¿³¼ë¥^,—^-U±³’&ûÖò.ùd\u001eªcùsÿ\0MV¹_ø&ÏÂ¿øEþ\u0016ê>2»‡m÷ˆî6[³\u000eE¬$¨#Ót†Cî\u0015\r|8Þ)ñOÇûï†~\u0001góŸK‰4M;©\u0018’cûÆôÚžZŸöa\aÖ¿c¼%á›\u001f\u0005ø_IÐ4Øü«\r2Ö;H\u0017¾ÄP ŸsŒ“êh\u0003ówà\u008fü¤ŸQÿ\0±—Ä\u001fú.ò¿N+ó\u001fà\u008fü¤ŸQÿ\0±—Ä\u001fú.ò¿N(\u0003â_ø)§Å/ìŸ\u0006è\u001e\u0002´›\u0017\u001a´ßÚ\u0017ª§‘o\u0011ÄjG£IÏÖ\u001aö_Ø·áoü*¿€:\f\u0013Ãåjš¸þ×½ÈÃ\u0006”\u0002Š}\nÆ#\u0004zƒ_\0ü^¾ñ/íaûNk£ÁÖ'\\˜HÐi–âHÖ?²ÛŒ\aÝ!\b\u0015°_\fy2c¾+Þ\u0015\u007fnTPª\u0002¨\u0018\0\r\v\u0002€='þ\n7ð·þ\u0013\u001fƒ–Þ(µ‡~¡á›\u008f5ÊŒ“k)T\u0090~\f\"o`­ZßðOŸŠ_ðŸ|\nƒF¹›ÌÔü17ö{†9cn~h\u001bé·r\u000fúå^'¯h\u007f¶Ç‰´MCHÕ-–óM¿‚K[›w:\u0018\u0012FêU”‘ÈÈ'§5À~Å~(Õ~\u0003þÓ’ø3Ä°¶˜ú±m\u0016öÖGV\u0011Ý\u0003º\u0003•$6[ä\u0004\u0012\b—#4\u0001ö‡íË4\u0090~Êþ:h²\u0018Çh§\u001fÝ7\u0090\u0003ú\u0013^kÿ\0\u0004Ã†5ø#â9@\u001ekxŠUo]¢ÚÜ\u008fý\t«Þÿ\0h¯\u0005Íñ\vào\u008dt\u001bhÌ×wZl­o\u001aŒ—š1æF£êÈ£ñ¯“¿à—~:·X|iàé¤\tr^-VÚ2yuÇ•)ü1\u000fýõ@\u001f{×œüvøí þÏž\u0011´ñ\u0017ˆ­5+Û+«äÓÒ=.(ä\u0090HÑÉ $; Ûˆ›¾rG\u0015èÕ\u008fâ\u007f\aè>6Óã±ñ\u0016‡¦ëöQÊ&KmRÒ;˜Ö@\n‡\nà€À3\fõÃ\u001fZ\0ùsþ\u001esð»þ€>/ÿ\0À;_þI¯uø\u0013ñÛAý ü#wâ/\u000eÚjVVV·Ï§¼z¤QÇ!‘cŽB@Gq·\u0012¯|ä\u001e+Æ\u007fm/ƒÞ\u0002ð¯ìÑã\u001dSEðG‡4\u008dN\u000f±ùW¶\u001aM¼\u0013Gºö\u0005m®¨\bÊ±\a\a\u0090Hª\u001fðLoù º÷ýŒ·\u001fúKk@\aü\u0014çþH.ƒÿ\0c-¿þ’ÝW\u0081|\aý\u009d~=xïáN‡®x/âwü#Þ\u0019ºóþÉ¦ÿ\0oßÚù;g‘\u001f÷qFQrêíÁçvO$×¾ÿ\0ÁN\u007fä‚è?ö2Ûÿ\0é-Õwß°\u007füš—\u0081ÿ\0íûÿ\0K®(\u0003À¿á‘ÿ\0j?ú-\u001fùujŸüjº\u000f‡ß²ÿ\0í\u001fáÿ\0\u001eøkT×>-ÿ\0ih–:\u009dµÍõ—ü$š”¿h·IU¤\u008fcÄ\u0015·(aµˆ\a8<WÛTP\u0001E\u0014P\u0001E\u0014P\u0001E\u0014P\u0001E\u0014P\u0001_,ür³û'Ä\u008dE€ÂÎ‘J?ï…\aõ\u0006¾¦¯œ¿hë\u007f/Æv2\u0081\u0081%Šƒõ\u0012?ôÅ\0~@\u007fÁC4[-+ãÕµÕ¤\u001eTú–‹owvûØù²‰%„6\tÀýÜ1®\u0006\aËœd’~c¯³\u007fà¥ž\u001b¶µñW‚5ôy\u008dåõ•ÍŒ‘±\u001eXŽ\aGB£\u0019ÜMÌ™ÉÆ\u0002à\u000esñ•\0\u0015÷\u0017ü\u0013/þjGýÃ\u007föê¾\u001d¯¸¿à™\u007fóR?î\u001bÿ\0·T\u0001ú•û4Â\u001bT×%î°Æ¿›1þ•ï•á\u007f³2þûÄMè¶ãó2\u007f…{¥\0\u0014QE\0\u0014QE\0\u0014QE\0\u0014QE\0~cÿ\0ÁN\u007fä½h?ö-[ÿ\0éUÕ~œW˜üNýš~\u001büd×­õ¯\u0018xsû_S‚ÙlãŸí×0m‰]Ü.Ø¤P~i\u001cäŒó×¥zu\0dx»ÂºoŽ<1ªx\u007fW€\\éš•»Û\\F{«\f\u0012\u000fb:ƒØ€kñÏâ\u0006“â_Ù÷Ä_\u0010~\u001bÜÈM¦ ±ZÜn\u0004%Ä1Ï\u001dÅ¼ê=HAô\u000eã­~Ñ×š|Ný›¾\u001c|dÖ-µ_\u0018xi5mFÞ\u000f³Gp.ç·a\u001eâÁO•\"î\0±ÆsŒš\0ðÿ\0ø&7ü\u0090]{þÆ[\u008fý%µ¯¨<màý3â\a„µo\u000ek0ý£LÔíÞÚt\u001c\u001d¬>òžÌ\u000e\b=ˆ\u0006²þ\u0018ü%ð§Á½\u0006ãEð~•ý‘¦Or×’Aö‰gÝ+\"!mÒ»\u0011òÆƒ\0ãŽ\u009dk¯ \u000fËÏ\u000ejÞ8ÿ\0‚{üd»µÕ,eÕü#ª\u001dŒÑå\"Ô SòK\u0013tY\u00901Êž›ˆ<\u0015jû\u007fÁ\u007f¶\aÂ/\u001béñÝ[øÛMÒ¤eËÚëS-”±ŸîŸ0…'ÝI\u001eõé¾*ð†‰ã\u008d\u0016m#Ä\u001aU¦³¦Í÷ío\"\u0012&{\u0010\u000fB;\u0011Èí_:x‹þ\tÉð‡\\ºy­\u0013\\ÐUŽ|\u009d:ü2\u000f§œ’\u001fÖ€:Ïˆß¶·Âo‡ºdÓ§Š-|I|\u0014ùV:\u0013‹¦•»\u000f1\u007fv£Ý›óé_\u001cø'Á~2ý¾>8Iâ¿\u0010ÛI¦ø.ÎEŽi\u0010Ÿ*\vt9[HXýé\u001b$³\u000e›‹\u001c|ª~¥ðŸü\u0013Ïàÿ\0†/\u0012âæÇTñ\u0013!Ê¦­{”ÏºÄ±ƒô9\u0015ô^\u008f£Øx\u007fM·Ó´»+};O·]\u0090ÚÚÄ±E\u001aú*¨\0\u000f¥\0Kce\u0006›goik\n[ÚÛÆ±E\fc\nˆ£\n v\0\0*z( \u0002¼\vöðÿ\0“RñÇý¸ÿ\0éu½{í`xóÀz\u0017Äß\n_xkÄ¶?ÚZ%÷—ö‹_:H·ì‘d_š6V\u0018dSÁ\u001d=(\u0003æ?ø&7ü\u0090]{þÆ[\u008fý%µ¯|ý ¿ä‚üIÿ\0±kRÿ\0ÒY+Cá\u008fÂ_\n|\u001bÐn4_\aé_Ù\u001ad÷-y$\u001fh–}Ò²\"\u0016Ý+±\u001f,h0\u000e8éÖ·üA Øø«AÔ´]R\u000fµiš•´¶wPodó\"‘\n:îR\bÊ±\u0019\u0004\u0011ž\r\0|+ÿ\0\u0004¬ÿ\0šŸÿ\0p¿ý»¯ºõí\u000eÃÄú&¡£ê–Ëy¦ßÀö·6îH\u0012FêU”‘ÈÈ'§5Çü+ø\u000fà_‚\u007fÚŸð…è\u007fØßÚ~WÚÿ\0ÒçŸÌò÷ìÿ\0ZíŒy\u008fÓ\u0019Ï=\u0005wô\u0001ä^\u0003ý“~\u0014|2ñE§ˆü7á5Óõ›@â\v¦¿ºŸËÜ¥\u0018…’V\\íb3Žõë´Q@\u001f˜ÿ\0\u0004\u007få$ú\u008fýŒ¾ ÿ\0Ñw•ö\u007fíƒñKþ\u0015?ÀO\u0011j0Mäêš„\u007fÙv\u0004\u001c7\u009d0 °÷T\u00128÷JÛÐÿ\0fŸ†þ\u001cø•'\u008fôï\u000e}ŸÅ²\\Ü^6¡öë–Ì³‡\u0012·–Ò\u0018þa#ñ·\u0003<\u0001\u0081Z¿\u0014¾\tø3ãM\u009d…§Œ´†Ö-¬dimâ\u0017“ÀªÌ\0,DN»Ž\a|ãœu4\u0001ò—ü\u0013\u001fáoØ|?â?ˆ\u0017pâkù?²ì\u0019‡>J\u0010ó0ögØ¿X\u008d}ÍX~\nð^‹ðïÂö\u001e\u001dðíŠéº5Š”·µGg\b\v\u0016?3\u0012Ä–bI$œšÜ \u0002¿8¿à¤\u001f\u000eî<\u001bñCÃ¿\u0011t\u009dÖßÚˆ±Íq\u0017\u0006;Ë|\u0018ß>¦=˜ÿ\0®F¿Gk”ø•ð·Âß\u0017¼:º\u001f‹´¥Ö4µ\u009dnV\u0016šHŠÈ €Á£e`pÌ8=\t \b>\u000e|D·ø¯ð¿Ã~,·Ú?´ìÒYQ:G0ùeOø\fŠëøWÃ\u001f´—Àÿ\0\u0016~Ì\u007f\u0016×â÷Ãˆ]´\u0016¹k¹£†2ë`ïŸ6)P\u007fË\aÉÁà.í¼\u0010¤ýáðãá\u008f†þ\u0012xlh>\u0014ÓÛKÒDÍ8¶k™§\ní\u008dÄ\u0019]ˆ\a\u001d\u0001ÆrqÉ®žHÖXÙ\u001dC£\f2°È#ÐÐ\aÌ¿\tÿ\0à _\r<y¦Àž!½o\u0006ë{@–ÞýY­Ëw)2\u008d»\u007fßÚ}\u008fZõvý£~\u0015,\u001eiø‘á]¸Î\u0006±n[þùßŸÒ¸¯\u001eþÃÿ\0\b|}w-ä¾\u001bþÄ½\u0090åæÑf6ÀŸ_,f1ø-pqÿ\0Á3~\u0015G6öÕüU\"çý[^Ûíý-Áýh\u0003–ý³ÿ\0k?†¾1ø3â\u000f\u0004øsZm\u007fXÔšØ,–P7Ùâ\u0011ÜE)-#\0\u000eDd\r›¹#8ë]gü\u0013GM»Óþ\0ê¯uk5²]x‚yài£(%ŒÛ[(tÈù—*Ã#Œ©\u001d«Ñ|\tû\u0018ü!ø\u007fp—6ž\u0012·Ôï\u0013‘q¬;^\u0010GB\u0011É@}Âƒ^Øˆ±¢¢(DQ€ª0\0ô \u000f‘¿à§?òAt\u001fû\u0019mÿ\0ô–ê°?d¿ÚÓáOÃ?Ù÷Â¾\u001añ/Š¿³u»\u001fµ}¢×û:î]›îæ‘~hâe9WSÁ=}kê¿‰ß\t|)ñ“A·Ñ|a¥\u007fké\u0090\\­äp}¢X6Ê¨è\u001btN¤ü²8Á8ç§Jó\u001fø`ÿ\0\u0081Ÿô#ÿ\0åZûÿ\0\u008fÐ\u0001ÿ\0\ráð3þ‡\u008fü¤ß\u007fñŠ?á¼>\u0006\u007fÐñÿ\0”›ïþ1Gü0\u007fÀÏú\u0011ÿ\0ò­}ÿ\0Çèÿ\0†\u000fø\u0019ÿ\0B?þU¯¿øý\0{í\u0014Q@\u0005\u0014Q@\u0005\u0014Q@\u0005\u0014Q@\u0005x\u001fí-\b]WC—»C\"þL\u000fõ¯|¯\ný¦W÷Þ\u001doU¸\u001f‘\u008füh\u0003ò»þ\niÿ\04ßþâ_ûk_\u000e×Ü_ðSOù¦ÿ\0÷\u0012ÿ\0ÛZøv€\nû‹þ\t—ÿ\05#þá¿ûu_\u000e×Ü_ðL¿ù©\u001f÷\rÿ\0Ûª\0ýRý™›÷Þ\"_U·?‘“ükÝ+Àÿ\0f™‚êšä]Ú\u0018Ûòf\u001fÖ½ò€\n(¢€\n(¢€\n(¢€\n(¢€\n(¢€\n(¢€\n(¢€\n(¢€\n(¢€\n(¢€\n(¢€\n(¢€\n(¢€\n(¢€\n(¢€\n(¢€\n(¢€\n(¢€\n(¢€\n(¢€\n(¢€\n(¢€\n(¢€\n(¢€\n(¢€\n(¢€\nð¯Úe¿}áÕô[ƒù˜ÿ\0Â½Ö¼\u000fö–˜6«¡ÅÝa‘¿6\u0003úP\aå¯ü\u0014Óþi¿ýÄ¿öÖ¾\u001d¯¸¿à¦ŸóMÿ\0î%ÿ\0¶µðí\0\u0015öwü\u0013OÄ–¶¾(ñÆ€é1½¾³¶¾‰ÕG–#\u0081Ý\u001c1Îw\u0013s\u001e0\bÀl‘\u0081ŸŒké¿ø'ž¹e¤ü{¸µº›ÊŸSÑ®--\u0017c\u001f2Q$S\u0015È\u001c~î\u0019\u000eN\aËŽ¤\u0002\u0001û\u0001û8Üy~3¾ˆœ\t,X\u008f¨‘?¡5ôm|µð6óì¿\u00124å'\v:K\u0011ÿ\0¾\t\u001fªŠú–€\n(¢€\n(¢€\n(¢€\n(¢€2<Mã\r\aÁ:z_x‹[Ó´\u001b'\u0090B·:\u009dÜvÑ³\u0090H@Î@,B±Ç^\u000f¥Wð¯Ä\u000f\vøëí?ð\u008dx“Hñ\u000fÙvùÿ\0ÙWñ\\ù[³·\u007f–Çnv¶3×\aÒ¾\u0001ÿ\0‚\u008füD¸ñ—Å\u000f\u000eü9Òw\\\u009d-\u0016I­âäÉyq\u0081\u001acÔG³\u001fõÔ×/û#ëš—ìçûWÜx'Ä\u000e°&¡3èW\u0081IòÌÅ\u0081·‘sŒ†` \u0013ü2š\0ýE®V?Šþ\t—ÄGÃéã\u001d\u0001õï8Û\u007fe®©\u0001ºóAÁ\u008fÊß»p ü¸Ï\u0015ÕWæŸíýà«Ï…?\u001f4\u001fˆš 6¿Ú¾]êL£ˆï­Š‚xõQ\u0013{\u009dÔ\u0001úYEs¿\u000e¼mgñ\u001fÀš\u000f‰ì\bû.«g\u001dÒ®s°²\u008dÈ}Õ²§Ü\u001aè¨\0®W_ø¯à\u008f\njßÙzßŒt\r\u001fSÂ·Øµ\rR\b&Ã}Ó±Ü7=¸æº;ëë}.ÆâòîU‚ÖÞ6šY\\áQ\u0014\u0012Ì}€\u0004×åÿ\0À»\u001b\u008fÚ§öÐ¸ñEüM&—\u0005ãës$ƒ!-á*¶Ñ\u001eÇ‘\n‘Ü\u0006 \u000fÔzÈñ7Œ4\u001f\u0004éé}â-oNÐlžA\nÜêwqÛFÎA!\u00039\0±\nÇ\u001dx>•¯_œ_ðQÿ\0ˆ—\u001e2ø¡áß‡:Në“¥¢É5¼\\™/.0#Lzˆöcþºš\0ûûÂ¿\u0010</ã¯´ÿ\0Â5âM#Ä?eÛçÿ\0e_ÅsånÎÝþ[\u001d¹ÚØÏ\\\u001fJß¯Ë¯Ù\u001f\\Ô¿g?Ú¾ãÁ> u\u00815\tŸB¼\nO–f,\r¼‹œd3\u0005\0Ÿá”×ê-\0\u0015Ì_|Qðf™âUðíç‹´+O\u00104±ÂºLú”)vd\u0090)\u008d\u0004E·n`Ë\u0081Œ\u009dÃ\u001dk§¯Ì\u007f\u008dßò’};þÆ_\u000fÿ\0è»:\0ý8®cÄÿ\0\u0014|\u0019à\u009dB;\u001f\u0011x»BÐ/dˆL–Ú¦¥\r´\u008d\u0019%C…v\u0004©*Ã=2§ÒºzüÇÿ\0‚œÿ\0ÉzÐ\u007fìZ·ÿ\0Ò«ª\0ý8¢Š(\0¢Š(\u0002½þ¡k¥XÜ^ÞÜÃggm\u001bM=ÅÃ„Ž$PK;1áT\0I'€\u0005s\u001a\u000fÆ\u001f\u0001x«U‡LÑ|oáÍcRŸw•ga«[Ï4˜RÇj#’p\u0001'\u0003 &¼\u001bþ\n%ñKþ\u0010\u007f‚káëY¼½KÅ\u0013ý—\npÂÚ<<Ä}\u007fv‡ÚC_Ÿº>Ÿâ\u007f€º÷ÃŸ\u001eÉna[àºÎŸÉ\u001elI3#Fßï*ƒþì«ë@\u001fµTV\u007f‡õÛ?\u0014h:n³§KçØj\u0016ÑÝÛÈ?Š7PÊ\u007f\"+B€0<Uñ\aÂÞ\u0004û/ü$¾%Ò<=ö­ßgþÕ¿Š×ÎÛ\u008dÛ<Æ\u001b±¹sŽ›‡­sÿ\0ðÐ_\v¿è¤øCÿ\0\a¶¿ür¾Dÿ\0‚©ÿ\0Í0ÿ\0¸§þÚVÇÂïø'oÃ\u008f\u001b|3ð\u008fˆ¯µ¿\u0014Å{«é\u0016z„ñÛÝÛ,k$°¤Œ\u0014\u001brB‚Ç\u0019$ã¹ \u000f«l~7|:Õ&Xl¼}á{¹˜ácƒY¶v'Ð\0õÙÇ\"M\u001aÉ\u001b+£\rÊÊr\b=\b5ñ¶µÿ\0\u0004¿ð\u001cönºOŠüGeu\u008f’KÓop€ûªÇ\u0019?÷Ð¯\nø{ãß\u001d~ÄŸ\u001eað?ˆu6¿ð¬—\u0011-Í¶ökw·”€·Pƒ÷\u0018u u*ÊsÁ\0\u001f¨\u0015\u0081â¯ˆ>\u0016ð'Ù\u007fá%ñ.‘áïµnû?ö­üV¾vÜnÙæ0Ý\u008dËœtÜ=k~¾\u0005ÿ\0‚©ÿ\0Í0ÿ\0¸§þÚP\aÞZ~¡k«iö×Ö70ÞÙ]D³Aso ’9c`\u0019]XpÊA\u0004\u0011Á\u0006¬W\u0001û>ÿ\0É\u0005ømÿ\0bÖ›ÿ\0¤±×\u007f@\u0005`x«â\u000f…¼\tö_øI|K¤x{í[¾Ïý«\u007f\u0015¯\u009d·\u001b¶yŒ7crç\u001d7\u000fZß¯\u0081\u007fàª\u007fóL?î)ÿ\0¶”\u0001õßü4\u0017Âïú)>\u0010ÿ\0Áí¯ÿ\0\u001c£þ\u001a\váwý\u0014Ÿ\b\u007fàö×ÿ\0ŽWËŸ\v¿à\u009d¿\u000e<mðÏÂ>\"¾ÖüS\u0015î¯¤Yê\u0013Çowl±¬’Â’0PmÉ\n\v\u001cd“Žæº\u007føv7Âïú\u000fx¿ÿ\0\u0003-\u007fù\u001a€>ŒÐ~1x\vÅZ´\u001a^‹ã\u007f\u000ejúœû¼«+\rZÞy¤Ú¥›j+’pªIÀà\u0002k¯¯œ¾\u0012þÂž\u0002ø7ñ\aJñ†‹«øŽëSÓ|ß*+û›w…¼Èž&Ü\u0016\u0005'å\u0090‘†\u001c\u0081ô¯£h\0¢Š(\0¢Š(\0¢Š(\0¯œ¿hë\u008f3Æ–1\u0003‘\u001dŠçêd\u007féŠú6¾Yøãyö¿‰\u001aŠƒ•\u0081\"ˆ\u007fß\nOêM\0~e\u007fÁJüImuâ¯\u0004h\v\u001c¢îÆÊâúI\b\u001eYIäD@\u000es\u0090mŸ<t+Éç\u001f\u0019WÓŸðPÍjËUøõmki?›>›¢ÛÚ]¦Æ\u001eT¦If\v’0\u007fw4m‘‘óc9\u0004\u000f˜è\0¯\\ý’üImá_Ú3À×·qË$RÞµŠ¬ \u0016ó.\"{xÉÉ\u001f(yTžø\a\0ž\u000f‘Ö·„|KsàÏ\u0016h¾ ³Š\u0019¯4›ØoáŽà1\u008dÞ)\u0015Ô8R\tRTg\u0004\u001cw\u0014\u0001û™à]Gû'ÆZ-Ñ8XîãÜ\u007fÙ,\u0003~„×ØÕðê±V\f§\u0004\u001cƒ_jhz’ë\u001a-…òœ­Ì\u0011Ì?àJ\u000fõ \vÔQE\0\u0014QE\0\u0014QE\0\u0015›âO\u0010YxOÃºž·¨Ëäéúu´—w\u0012\u007fv4RÌ\u007f kJ¾Kÿ\0‚Ž|Rÿ\0„?àí¯…mfÙ¨xšãËp§‘k\u0011W\u0090þ,b_pZ€>vý\u008fü?{ûB~ÕÚ\u008fŽõ¨¼Ë}:yuÛ€ÜªÎÎE¼`ÿ\0²Nåö†ºoø)GÃ‰¼/ñ\aÃ\u007f\u0011t°Öÿ\0ÚH¶·\u0013ÅÁK¨0b|ÿ\0xÇ€?ë\u008d{çü\u0013ïáoü \u001f\u0002mõ‹˜|½OÄòÿ\0h9a†\u0016àm\u0081~›rãþº×\u007fûUü-ÿ\0…½ð/Äº$0ùÚœ0ý¿O\0e¾Ñ\u0016YU}ØnOø\u0019 \u000e“à—Äx~-|)ð×Šá+¿P´V¸Dè“¯É2þ\u0012+\u000f¦+Ï?mÏ…¿ð´>\0ë‚Þ\u001f7TÑ?âoi\u0081–>P>j\u008f\\Ädã¹\v^\u000fÿ\0\u0004Åø¥æÚø›áõÜß4Djö\nÇøNØçQô>S\u0001þÓ\u001aûÆHÖXÙ\u001dC£\f2°È õ\u0004P\aÅ¿ðLßŠ_Û^\u0005×<\tw6ntYþÛf¬y6ÒŸ\u009d@ôY2Oýu\u0015ö¥~YxfFý\u0090ÿ\0m¦±•\u008d·‡Íù´fc…:uÖ\flOq\u001eäcï\u0011¯ÔÚ\0ù«öýø¥ÿ\0\n÷à5î—m7—©øšOìÈ‚Ÿ˜BFéÛé°l?õÔW5ÿ\0\u0004Ýø[ÿ\0\bŸÂKï\u0016ÝC²ÿ\0Ä·9‰˜r-a,‰ôË™O¸Úkçÿ\0Û?Ä—¿\u001eÿ\0j]/À:$žtZdÑh–øå\u0005ÌŒ\fò\u001fM¤ª·ýq¯Ò_\nønËÁ¾\u0019Òt\u001d6?*ÃMµŠÒ\u0005î\u0011\u0014(Ï¾\a4\0ÿ\0\u0012x‚ËÂ~\u001dÔõ½F_'OÓ­¤»¸“û±¢–cù\u0003_šŸ±ÿ\0‡ï\u007fhOÚ»QñÞµ\u0017™o§O.»p\u001b•YÙÈ·Œ\u001föIÜ¾Ð×Ñ?ðQÏŠ_ð‡ü\u001dµð­¬Û5\u000f\u0013\\yn\u0014ò-b*ò\u001fÅŒKî\vVÏü\u0013ïáoü \u001f\u0002mõ‹˜|½OÄòÿ\0h9a†\u0016àm\u0081~›rãþºÐ\a\u0081ÿ\0ÁJ>\u001cMá\u007fˆ>\u001bø‹¥†·þÒEµ¸ž.\n]Aƒ\u0013çûÆ<\u0001ÿ\0\\kíÿ\0‚_\u0011áøµð§Ã^+„®ýBÑZá\u0013¢N¿$ËøH¬>˜®oö«ø[ÿ\0\v{à_‰tHaóµ8aû~ž\0Ë}¢,²ªû°ÜŸð3_4\u007fÁ1~)y¶¾&ø}w7Í\u0011\u001a½‚±þ\u0013¶9Ô}\u000f”À\u007f´Æ€>ó¯Ì\u007f\u008dßò’};þÆ_\u000fÿ\0è»:ý8¯Ì\u007f\u008dßò’};þÆ_\u000fÿ\0è»:\0ý8¯Ì\u007fø)Ïü—­\aþÅ«\u007fý*º¯ÓŠüÇÿ\0‚œÿ\0ÉzÐ\u007fìZ·ÿ\0Ò«ª\0ý8¢Š(\0¢Šá>:|J‹á\u001fÂ_\u0013x®FQ5…£}™[£Ü6\u0012\u0015Ç¡v\\ûf€?>?j-bïö”ý¯¬¼\u0015¤Ì^ÊÊê=\u0006\u0006NB\u0015bn¥Çû-ægÔD+é_Û»à­¦µû9ÚÏ£Z\bäðHŽ[XÐd­˜UŠT\u001eÁB9öŠ¼gþ\t§ðÚ_\u0011xãÄ¿\u0011u%iÆž†ÊÖiy/u7Í+çûÊœ\u001fúí_¡\u001a¶—k®iwšuô+qey\vÛÏ\vtxÝJ²Ÿb\t\u0014\u0001òßü\u0013Ÿâ—ü&\u007f\u0006fðÍÔÛõ\u001f\f\\y\n\u0018å\u008d¬¤¼Gðo1}‚-}__—\u007f³~©uû1~Ø×~\u000eÕ&dÓîîäÐgy8\u000e²0kY±þÑòŽ{,\u008d_¨”\u0001ð/ü\u0015Oþi‡ýÅ?öÒ¾»ýŸ\u007fä‚ü6ÿ\0±kMÿ\0ÒXëäOø*ŸüÓ\u000fûŠ\u007fí¥`|>ÿ\0‚kÿ\0Âwà/\rx—þ\u0016/Ø\u007f¶tËmGì¿Ø~g“çD²lÝö\u0081»\u001b±œ\fã  \u000fÐ\u009dgÄ\u001a_‡lÞïVÔ¬ôËXÆ^{ÉÖ$QêYˆ\u0002¿0¿hï\u0010Û~Õßµ†‘¥ø+v¥f#·Ñâ¼…NÙ\u0015$y%ŸýÅó\u001fæôLô\"½'Pÿ\0‚XÞÇnÆÇâE½ÌøùRãFhTŸv\u0013±\u001f•rß\u000e|kâŸØ\u001fâ4^\u001dñÏ…t›Í\u0017Rë­éöêndƒw/\u0014ø\r\"©äÅ \a§ÝÈ$\u0003ô¶¾\u0005ÿ\0‚©ÿ\0Í0ÿ\0¸§þÚWÞ\u001a^¥k­i¶š…Œéuew\nO\u0004ñœ¬‘²†V\aÐ‚\u000fã_\aÿ\0ÁTÿ\0æ˜\u007fÜSÿ\0m(\u0003ë¿Ù÷þH/Ãoû\u0016´ßý%Ž»úà?gßù ¿\r¿ìZÓ\u007fô–:ïè\0¯\u0081\u007fàª\u007fóL?î)ÿ\0¶•÷Õ|\vÿ\0\u0005Sÿ\0šaÿ\0qOý´ \u000f®ÿ\0gßù ¿\r¿ìZÓ\u007fô–:ïëó›á÷ü\u0013_þ\u0013¿\u0001xkÄ¿ð±~Ãý³¦[j?eþÃó<Ÿ:%“fï´\rØÝŒàg\u001d\u0005oÿ\0Ã«?ê§ÿ\0å¿ÿ\0ÝT\u0001÷Õ\u0015ò'À\u007fØ\aþ\u0014ŸÅm\u000fÆŸð\u009dÿ\0lÿ\0fyÿ\0è?ØþG™æA$_\u007fÏlcÌÏÝ9Æ;æ¾» \u0002Š( \u0002Š( \u0002Š( \u0002¾9ñÖ£ý­ã-jè\u001c¬—rm?ì†!\u007f@+ë\u008dsR]\u001fE¿¾c…¶‚I¿ï•'úWÅNäîv9=I4\u0001ù-ûZx’ÛÅ_´gŽomc–8¢½[\u0012³\0\u001b}¼Inä`ž\vÄÄwÁ\u0019\0ñ^GZ¾,ñ%ÏŒ¼U¬ë÷©\u0014Wš­ì×Ó¤\0ˆÖIdg` ’BåŽ2IÇsYT\0QE\u0014\u0001úáû+ø›þ\u0012ßÙçÀ—ßfû'•§-‡—¿~~ÌÍo¿8\u001f{ÉÝŽÛ±“ŒŸ¾>\u0006êßÚŸ\u000f,Ð¶é,ä{fü\u000eåÿ\0ÇXWäßü\u0013wÆSêž\u0003ñW†¥I\u001a=\"ú+¸fy‹\0—\bÃÊT#å\nÐ3py2ž\u00062\u007fJ\u007ffÝsÊÔµ]%Û‰£[˜ÁõSµ¿0Ãþù \u000f{¢Š(\0¢Š(\0¢Š(\0¯Êÿ\0ÚcRÕ¿j/ÚÝ¼'á¹\"˜ZÍý…§´ÌD+åniåb ü¡üÒX\u0002v¨ëÅ~…þÐŸ\u0013“á\aÁß\u0013ø£z­Ý­©ŽÈ\u001fâ¹“ä‹Žøf\u0004û\u0003_\u001dÿ\0Á2þ\u0018¾©â\u000f\u0013|D¿F”Z¯öe”²sºgÃÌùþð]ƒ?ôÕ¨\u0002ÕŸìwûMéöpZÚüaŽÚÖ\u0004X¢‚\u001f\u0013êh‘¢Œ*ªˆp\0\0\0\aLT¿ðÈÿ\0µ\u001fý\u0016\u008füºµOþ5_}Q@\u001f‘ºn“âoØ¿öšðìÞ&ž\tæ·’+›«›\u0019\u001eH®lçÊJÊ]U˜€d\u001c¯ÞO¡¯ÖøfKˆRX\u009dd‰Ô2ºœ†\a\u0090Aô¯\u008d?à¥ß\v\u007f·¾\u001ehÞ8´‡uÖ…?ÙnÙG&Úb\u0002“þì\u0081@ÿ\0®¦½7ö\u001bø¥ÿ\0\v3à\u0006\u008d\u001dÄÞn© Ÿì‹­Çæ\"0<¦üb(3Ü«P\aŠ\u007fÁN~\u0016ý«Jð×Ä\u001bHs%«\u001d&ý”så¶^\u0016>Á¼ÅÏ¬‹^¹ð‡ö’¶¸ý\u008fGÄ\rFeŸPðþœöw«#s%ä $jÇÖRÐŸûk^»ñ“áÝ¿Å\u008f…þ$ð\u009dÆÑý¥fñÄïÒ9‡Í\u0013ÿ\0ÀdToÂ¿\u001b\u007fá6ñ\u0017†<\u0019â\u000f‡ò;Úé×z”W7¶Ž\beš\u0001\"mö\u0004°Ü=bOJ\0ú\u008fþ\tÑðþçÇŸ\u0017¼Cñ\u0017XÝtt¥r—\u0012\u000ed½¹-¹óÜ„ó3ï\"×é\u0015x§ìwð·þ\u0015?À?\u000eØO\u000f•ªj)ý«~\bÃy³\0BŸuŒF‡ÝMtß´'ÄäøAðwÄþ(Þ«wkjc²\aø®dù\"ã¾\u0019\u0081>ÀÐ\aç§í1©jßµ\u0017ínÞ\u0013ðÜ‘L-fþÂÓÚf\"\u0015ò·4ò±P~Pþi,\u0001;Tuâ½FÏö;ý¦ôû8-m~0Çmk\u0002,QA\u000f‰õ4HÑF\u0015UD8\0\0\0\u0003¦*¯ü\u0013/á‹êž ñ7ÄKôiEªÿ\0fYK';¦|<ÏŸï\u0005Ø3ÿ\0MZ¿Bh\u0003à_ød\u007fÚ\u008fþ‹Gþ]Z§ÿ\0\u001a¯\aÓtŸ\u0013~Åÿ\0´×‡fñ4ðO5¼‘\\Ý\\ØÈòEsg>RVRê¬Ä\u0003 å~ò}\r~¹WÆ?ðRï…¿Ûß\u000f4o\u001cZCºëBŸì·l£“m1\u0001Iÿ\0v@ \u007f×S@\u001feÃ2\\B’Äë$N¡•Ôä0<‚\u000f¥~e|nÿ\0”“éßö2ø\u007fÿ\0EÙ×Öÿ\0°ßÅ/øYŸ\04hî&óuM\u0004ÿ\0d]n?1\u0011\u0081å7ã\u0011AžåZ¾HøÝÿ\0)'Ó¿ìeðÿ\0þ‹³ \u000fÓŠüÇÿ\0‚œÿ\0ÉzÐ\u007fìZ·ÿ\0Ò«ªý8¯Ì\u007fø)Ïü—­\aþÅ«\u007fý*º \u000fÓŠ+äOøyÏÂïú\0ø¿ÿ\0\0í\u007fù&\u008føyÏÂïú\0ø¿ÿ\0\0í\u007fù&€>»¯\u0081ÿ\0à§_\u0014¾_\fü=³—–Î¯~ª\u007fÞŽ\u0005?ù\u0015ˆöC^ÿ\0ðGöÌðGÇ\u008f\u0013j\u001a&‡a­é³ØéòjsO«C\u0004PˆQãFù’g9ÌŠy\u0018À<×Åß\r-åý­\u007fm‰u»˜Ú}\u0012;æÕ$G\u001c-•±U\u0081\u0018\u007fµˆT\u008föØÐ\acà_Ø§öˆðÿ\0†í\u0013@ø\u008dmák+”[£¦[kÚ…¯”î \u0090é\u001c[wŽ\u0001Á=:šßÿ\0†Gý¨ÿ\0è´\u007fåÕª\u007fñªûêŠ\0üŒý¤ÿ\0g_‰ÿ\0\a\u007f³<]ã\u008f\u0011AâK‹û\u0081lº¥½ýÅÔÑÈ‰º0òLŠÃåS·\u0004ýÃÓŠý2ø\añ2?‹ß\b|1â\u0090Ê×7–ª·j¿ÃrŸ$Ã\u001d†õb=ˆ¬ïÚkápøÁðKÄÞ\u001eŠ/7Q6æêÃŽ~Ó\u0017Ï\u0018\u001e›°Sèæ¾Tÿ\0‚c|Q1\\xŸáíä¸Ýÿ\0\u0013k\u0004cÑ†ØçQøyL\a³š\0\u007fü\u0015Oþi‡ýÅ?öÒ¾»ýŸ\u007fä‚ü6ÿ\0±kMÿ\0ÒXëäOø*ŸüÓ\u000fûŠ\u007fí¥l|.ÿ\0‚‰|8ðOÃ?\bøvûDñL·ºF‘g§Ï%½¥³FÒE\nFÅI¸\u0004©*q\u0090\u000e;\n\0ûŠ¾3ÿ\0‚ ZÙ·Â_\n\\8_í\bõ¿.\u0012~÷”ÐJdÇ¶V,þ\u0015>¡ÿ\0\u0005=øu\u001d»5\u008f†|Qs>>T¸ŠÚ%'Ý„ÌGå_>ø›Tø\u009dÿ\0\u0005\u0004ø‹¦¥†ˆt\u007f\véìc\u008dþf´°F#Ì’IH\u001ed¤\u0001ò¨\u0004í\0\u0001É \u000f¶\u007fb«ë­Cö_ð\u001c·ŒÍ*ÛM\u0012–ÿ\0žiq*F?ï…ZùÏþ\n§ÿ\04ÃþâŸûi_nø\u0017Áö\u001f\u000f¼\u001b¢økKV\u0016\u001aU¤v‘\u0016ûÌ\u0015@ÜÞääŸrkâ/ø*ŸüÓ\u000fûŠ\u007fí¥\0}wû>ÿ\0É\u0005ømÿ\0bÖ›ÿ\0¤±×\u007f_\u000eü.ÿ\0‚‰|8ðOÃ?\bøvûDñL·ºF‘g§Ï%½¥³FÒE\nFÅI¸\u0004©*q\u0090\u000e;\néÿ\0áç?\v¿è\u0003âÿ\0ü\u0003µÿ\0äš\0úî¾\u0005ÿ\0‚©ÿ\0Í0ÿ\0¸§þÚW¶ü%ýºü\u0005ñ“â\u000e•àý\u0017Hñ\u001d®§©y¾T·öÖé\nùq<­¸¬ìGË\u0019\u0003\ny#ë^%ÿ\0\u0005Sÿ\0šaÿ\0qOý´ \u000f®ÿ\0gßù ¿\r¿ìZÓ\u007fô–:ïëáß…ßðQ/‡\u001e\tøgá\u001f\u000eßhž)–÷HÒ,ôùä·´¶hÚH¡HØ©7\0•%N2\u0001Ça]?ü<çáwý\0|_ÿ\0€v¿ü“@\u001f]Ñ_-ø?þ\n%ðãÆÞ.Ñ<;c¢x¦+Ý^ú\r>\t.--–5’Y\u00165,EÁ!Aaœ\u0002qØ×Ô”\0QE\u0014\0QE\u0014\0QE\u0014\u0001çÿ\0\u001cõoì¿‡·‘†Û%ä‰l¿‰Ü\u007fñÕ?\u009d|\u000fûTx›þ\u0011\u001fÙçÇwßfûW\u009d§5‡—ælÇÚYm÷ç\aîù»±ßn23‘õçí%®yº–•¤£q\fmq \u001e¬v¯ä\u0014ÿ\0ßUù·ÿ\0\u0005\u001cñõî‡à\u001f\u000exRÒIàƒ^º’{Ç†å‘e†ßa\u0010Èƒýb™%ŽNN\u0003@§\u0004à¨\aç½\u0014Q@\u0005\u0014Q@\u001eñû\u0012øú?\u0001þÐ\u001a*\\<QYë‘¾\u008d4’FîÀÊU¡\t·£4ÑÂ¹ €\u0019³\u008f¼?\\>\u001døƒþ\u0011\u008f\u0019éwìÛaYDržÞ[|¬\u007f\0søWàõ…ýÎ—}o{eq5\u009då´‹4\u0017\u0016îRH¤R\nº°åX\u0010\b#\u0090E~Íü8ñ­·Äo\u0001h\u001e'´\u0010¤Z¥”WM\u00143‰–\u0019\u0019Fø‹€2Èû\u0090ð\u000eT‚\u0001â€?A¨®Oáo‰\aŠ<\u0011¦Ý3n¸\u008d>Ï?®ôà“õ\u0018oø\u0015u”\0QE\u0014\0QE\u0014\u0001“âo\bè^4ÓÖÃÄ:.Ÿ®Ø¬‚Qk©ÚÇq\u0010p\b\rµÁ\u0019\0ž}Í;Ãž\u0015Ñ|\u001f¦\u008d;AÒ,4M<9\u0090Zi¶Éo\u0010cÕ¶ \u0003'×\u0015©E\0\u0014QE\0SÖ4m?Ä:eÆ\u009dªØÛjz}ÂìšÒò\u0015–)W®\u0019\u0018\u0010GÔVo…|\u0003á\u008f\u0002¥ÊxoÃšO‡’ä©\u009dt«\u0018­„¥s´¶Å\u001b±“ŒôÉ­ê(\0®'Pø\u001fðçVÔ./ï¼\u0001á{Ûë‰\u001ai®®4ki%–F9gf)’Ä’I<“]µ\u0014\0\u009d8\u0015•âo\bè^4ÓÖÃÄ:.Ÿ®Ø¬‚Qk©ÚÇq\u0010p\b\rµÁ\u0019\0ž}ÍkQ@\u0019~\u001cð®‹àý4iÚ\u000e‘a¢iáÌ‚ÓM¶Kxƒ\u001e­±\0\u0019>¸­J( \u0002©ë\u001a6Ÿâ\u001d2ãNÕlmµ=>ávMiy\nË\u0014«×\fŒ\b#ê*å\u0014\u0001ƒá_\0øcÀ©rž\u001bðæ“áä¹*g]*Æ+a)\\í-±Fìdã=2jµ÷Âï\u0006j~%_\u0011^xGB»ñ\u0002Ë\u001cË«O¦Â÷bHÂˆÜJWvå\n¸9ÈÚ1Òºz(\0®cÄÿ\0\v¼\u0019ãmB;ï\u0011xGB×ïcˆB—:¦›\rÌ‹\u0018%‚\u0006u$(,Ç\u001d2ÇÖºz(\u0003€ÿ\0†}ø]ÿ\0DÛÂ\u001fø\"µÿ\0ãt\u007fÃ>ü.ÿ\0¢má\u000fü\u0011Zÿ\0ñºïè \u000eGEøCàO\r½Ûé\u001e\nðî–÷–ïgrÖZT\u0010™ |o‰ö Ü\u008d\u0081•<\u001c\u000e*×…þ\u001aøGÀ÷\u0013ÜxsÂº/‡ç\u009d\u0004rË¥éÐÛ4Š\u000eB±E\u0004Œö5ÒQ@\u0005\u0014Q@\u0005rº?Â\u008f\u0004xw[\u001aÎ•àí\u0003LÖ\u0001v\u001a…ž—\u00047\u0019`C\u001f1P7 œóÎMuTP\u0006\aŠ¾\u001fx[Ç\u007feÿ\0„—ÃZGˆ~Ë»ìÿ\0Ú¶\u0011]y;±»g˜§nv®q×hô®\u007fþ\u0019÷áwý\u0013o\b\u007fàŠ×ÿ\0\u008d×\u007fE\0pö¿\u0002þ\u001bXÊ%¶ø{á[y\u0014ä<Z-²‘ø„®ÎÚÖ\u001b;t‚Þ(à†1„Ž5\nª=\0\u001d*Z(\0¬\u000f\u0015|>ð·ŽþËÿ\0\t/†´\u008f\u0010ý—wÙÿ\0µl\"ºòwcvÏ1NÜí\\ã®Ñé[ôP\a\u0001ÿ\0\fûð»þ‰·„?ðEkÿ\0Æèÿ\0†}ø]ÿ\0DÛÂ\u001fø\"µÿ\0ãußÑ@\u001c†ƒð{À^\u0015Õ Õ4_\u0004xsHÔàÝå^Øi6ðM\u001eå*Û]P\u0011•b\u000e\u000f ‘Z\u001e*ø}áo\u001dý—þ\u0012_\ri\u001e!û.ï³ÿ\0jØEuäîÆížb\u009d¹Ú¹Ç]£Ò·è \u000e\u0003þ\u0019÷áwý\u0013o\b\u007fàŠ×ÿ\0\u008dÑÿ\0\fûð»þ‰·„?ðEkÿ\0Æë¿¢€8\u008d?àoÃ\u008d'P¶¾±ø\u007fák+ÛYVh.mô[häŠE!•Õ‚eX\u0010\b#\u0090EvôQ@\u0005\u0014Q@\u0005\u0014Q@\u0005\u0014W'ñKÄƒÂþ\bÔ®•¶ÜJŸgƒ×{ñ‘ô\u0019oÂ€>kø‡â\u000føIüeª_«n…¥)\u0011íå¯Ê§ñ\u0003?\u008d~GþÛ^?\u008fÇŸ´\u0006²–ï\u0014¶z\u001ci£C$qº1h‹4Á÷uešI— \0B®3÷\u008féWÄ\u008f\u001b[|8ð\u0016¿â{±\u0013Å¥ÙKr!šq\nÍ\"©òâ\u000eAÃ;íAÁå†\u0001<Wã%ýýÎ©}q{{q5ååÌ\u008d4÷\u0017\u000e^IdbK;1å˜’I'’M\0AE\u0014P\u0001E\u0014P\u0001_ ßðN¯Š\u0012kž\tÖ|\u000f{4^n‡ º°V‘\u0004\u008do31‘U\0\fU%Ë\u0017%¹¸Uà\u0005ÏçÍz—ìËñJÛàÿ\0Æ\u008f\u000føƒQ’á4mÏi¨\b'hÇ‘*\u0014ÞáQÌ‹\u001b\u0014›ËÚK\u0018€\u0005N\u0018\0~é~ÎÞ(\u0016:åÞ‰3â+Ôóa\u0004ÿ\0ËE\u001c\u0081õ\\ÿ\0ß\"¾„¯‰ô­J}\u0017Sµ¾¶m—\u0016Ò,¨}ÁÏ>ÕöFƒ¬Áâ\u001d\u0016ËR¶9†æ%\u0090\u000fLõ\aÜ\u001c\u008fÂ€4(¢Š\0(¢Š\0(¢Š\0(¢Š\0(¢Š\0(¢Š\0(¢Š\0(¢Š\0(¢Š\0(¢Š\0(¢Š\0(¢Š\0(¢Š\0(¢Š\0(¢Š\0(¢Š\0(¢Š\0(¢Š\0(¢Š\0(¢Š\0(¢Š\0(¢Š\0(¢Š\0(¢Š\0+ç¯Ú'Äâû\\´Ña|ÅdžlÀ\u007fÏF\u001c\u0003ô\\\u007fßF½×_Ö ðî‹{©\\œCm\u0013HFzã¢\u008frp?\u001aøÛVÔçÖ5+«û¦Ý=Ä\u008d+·¹9ü¨\u0003ã_ø(·Å\aÑ<\u0015¢ø\u001eÊh¼ÝrSw~«*\u0019\u0016Þ\u0016S\u001a´d\u0012\u0015åÃ\a\u0004snÃœ¶?>«Ô\u007fiŸŠVÿ\0\u0018>4kþ!ÓÞá´mÉi§¬ó´ƒÈ‰\u0002o@È†5‘ƒÍåí\u0005L¤\u0012Ç,|º€\n(¢€\n(¢€\n(¢€?N?a\u007f‹¿ð±¾\u0010E¡ÞI»Xð·—§Éòã}©\aìÏÂ*Œ*4xË7îw1Ë×ß¿³¿Œ¶µÏ‡._ƒ›‹MÇþûAÿ\0¡\u007fßUø?û2|]ÿ\0…/ñ\u007fH×.$Ù£ÜfÃTã?è²\u0015Üü#7ÈÊ’aFæòöçæ5úû¤êwZ\u000e­m}lÆ+«Y\u0003®{\u0010z\u0011éØŠ\0ûZŠÉð¯ˆ­üY Yê–§\u0011Î™dÎJ0á”ý\u000ekZ€\n(¢€\n(¢€\n(¢€\n(¢€\n(¢€\n(¢€\n(¢€\n(¢€\n(¢€\n(¢€\n(¢€\n(¢€\n(¢€\n(¢€\n(¢€\n(¢€\n(¢€\n(¢€\n(¢€\n(¢€\n(¢€\n(¢€\n(¬Ÿ\u0015xŽÛÂz\u0005æ©ts\u001c\t•Là»\u001e\u0015GÔâ€<‡öˆñ–æ¶ðå³ð¸¸»Áïü\b\u007fô/ûæ¾\u0002ýº>/\u007fÂ¹øC&‡g&ÝcÅ>e„\u007f.vZ€>Òü£)ÊºÇŒ«~ûrœ¥}5«jwZö«s}tÆ[«©\v±\u0003©' \u001e\u009d€¯È?Úsâçü.\u008fŒ\u001a¾¹o'™£ÛâÃKùq›XËm~Q[çfy0ãrù›sòŠ\0òª(¢€\n(¢€\n(¢€\n(¢€\ný\u001cý€~1Ÿ\u0019ü;¸ðn¥t$Õü8@¶óeÌ“X¹;0\u0019Ë7”ÙC…\nˆÐ/S_œuÑü9ñþ­ð·ÆºWŠt7‰5=:Bñ‹ˆüÈÝYJ:0þë#2œ\u0010@l‚\u000e\b\0ýôø\u0015ãÑáíhè×’mÓïÜlf<G7@~\u008dÀúâ¾‘¯ÏŸ‡?\u00104ŸŠ\u001e\vÒ¼S¡<Í¦j1™\"óã1ÈŒ¬QÑ‡÷•Õ”à\u0090Jä\u00120OØŸ\a~!\u000f\u0019hbÒîLêÖJ\u0016]Ç™S “ú\u001f\u007f­\0z\u0015\u0014Q@\u0005\u0014Q@\u0005\u0014Q@\u0005\u0014Q@\u0005\u0014Q@\u0005\u0014Q@\u0005\u0014Q@\u0005\u0014Q@\u0005\u0014Q@\u0005\u0014Q@\u0005\u0014Q@\u0005\u0014Q@\u0005\u0014Q@\u0005\u0014Q@\u0005\u0014Q@\u0005\u0014Q@\u0005\u0014Q@\u0005\u0014Q@\u0005\u0014Q@\u0005\u0014Q@\u0005\u0014Q@\u0005\u0014Q@\u0005|ÝñÓÇ¿ð‘kCG³“vŸ`ç{)âIº\u0013ô^@ükÓ¾1üB\u001e\rÐÍ¥¤˜Õ¯T¬[O1'C'ô\u001eÿ\0Jøóâ7Ä\r+á\u007f‚µo\u0015k\u008f2éºtbI|ˆÌ’;3\u0004DQýævU\u0019 \u0002Ù$\f\u0090\u0001ó·íùñ x7áü>\tÓnLzÏˆ†n¼¶!¡±Sór®\bóX\u0004ä2²\t\u0081Ç\u0015ùÍ]\u001fÄO\u001fjß\u0014<iªø£\\xŸSÔe\u0012H \u008fdh\u0002„DQýÕEU\u0019$áy$äžr€\n(¢€\n(¢€\n(¢€\n(¢€\n(¢€>’ýŠ\u007fhTøIãGðî·s\u001c>\u0014×¥Q-ÅÄì±Ø\\\0BL\aÝ\nÿ\0*9 p\u0011‹\u0001\u001e\u000fêG†<Gwá=rÛS²lM\vd©èëÝO±\u0015øK_¢\u001f°¯í\u0014¾4ðØð\u000fˆ¯¬ Öôxb‡FS¹%¿µTl \u001bv\u0016…Q\aÞ\fÈÀí>\\\u008f@\u001f°>\u0015ñ5Ÿ‹´K}NÅó\u0014£\f‡ïFÃª·¸ÿ\0ëÖ½|¡ð¿â$Þ\u0003Ö³&ét»‚\u0016æ\u0011ÛÑ×Ü~£\u008fL}Qe{\u0006£i\rÕ¬«=¼Ê\u001e9\u0010ä2ž„P\u0004ôQE\0\u0014QE\0\u0014QE\0\u0014QE\0\u0014QE\0\u0014QE\0\u0014QE\0\u0014QE\0\u0014QE\0\u0014QE\0\u0014QE\0\u0014QE\0\u0014QE\0\u0014QE\0\u0014QE\0\u0014QE\0\u0014QE\0\u0014QE\0\u0014QE\0\u0014QE\0\u0015‘â¯\u0013YøGD¸ÔïŸ\u0011F0¨>ôŒz*ûŸþ¿jÐ½¼ƒN´šêæU‚Þ\u0015/$Žp\u0015GRkå\u008fŠ\u001f\u0011&ñæµ˜÷G¥Û’¶Ðž\tõv÷? ãÖ€9ÿ\0\u0013xŽïÅšÝÎ§zÙšfÈQÑ\u0017²\u008f`+òëöÚý ãø±ãXü9¡ÝCsáM\u0006Fòî­gvŽþá•CÊG\nU\u000eäB\u0001àÈÁŠÈ\0÷ÏÛ«ö‹_\u0005xq¼\u0003áÛÛ)õ½b\u0019aÖTeå°´dP\u0010‚»\u0003L®à|Å•T\u009d£Ì\u008dëóº€\n(¢€\n(¢€\n(¢€\n(¢€\n(¢€\n(¢€\nžÆúçK¾·½²¸–ÒòÞEš\u001bˆ\u001c¤‘H¤\u0015uaÊ° \u0010G Š‚Š\0ý^ý›¿iÍ\u001fö„Ðå\r\u0015¾\u008dâË5ß\u007f£BÍå…Î\u0004ÖûÙ™¢É\u0003\u0004–BB±9W\u007f­~\u000füT>\u0011¹\u001a^§#6\u008f3|®yû;\u001eÿ\0îžãñõÏàgÃÿ\0\u001bj?\rüm¢x£JÚ×úUÜwQÅ+È±Ì\u0014üÑIå²±\u008d×(ÁX\u0012¬Ã#5ú½ð+ã¦\u0081ñãÁé¬i,-oáÄz†“$\u0081¦³\u0090ô\a\u0081¹\u001b\u0004«€\u0003\0z2²¨\aéDr$Ñ¬‘²º0\f¬§ ƒÐƒN¯\u009d>\u0011|^>\u001bhô}fF}-Ž!\u009d¹6äö?ì\u007f*ú&9\u0012hÖHÙ^6\u0001•”ä\u0010z\u0010h\u0001ÔQE\0\u0014QE\0\u0014QE\0\u0014QE\0\u0014QE\0\u0014QE\0\u0014QE\0\u0014QE\0\u0014QE\0\u0014QE\0\u0014QE\0\u0014QE\0\u0014QE\0\u0014QE\0\u0014QE\0\u0014QE\0\u0014QE\0\u0014QE\0\u0014Ù$Hci$eDPY™Ž\0\u0003©&‰$Hci$eDPY™Ž\0\u0003©&¾vø½ñxø‘¤Ñ´i\u0019tµ8šuàÜ\u0011Ø\u007f±üè\u0002¯Æ\u000fŠ‡Å×-¥i’2èð·Ìã\u008f´°ïþèì?\u001fL|—ûH~Óš7ì÷¢Ä\u00046ú×Šï\u0017}†\u008d+°M¹#Î¸ØC,@‚0\bg ª‘†tßøéñ×Ãÿ\0\u0001¼\"Ú¾°ßi¾Ÿtzv•\v\u00815ä t\u001fÝA‘ºL\u0010 Ž\u0019Š«~Mø×Æ\u001aŸÄ\u000f\u0016j¾#Ög7\u001a–¥p×\u00136æ!sÑ\u0017q$\"Œ*®xU\u0003  \fËëû\u009dRúâööâ[ËË™\u001aiî'ròK#\u0012YÙ\u008f,Ä’I<’j\n( \u0002Š( \u0002Š( \u0002Š( \u0002Š( \u0002Š( \u0002Š( \u0002Š( \u0002º¯†_\u0013|Að\u008fÅöž#ðåßÙ¯ ù^7\u0005¢¸ˆ‘º)W#r6\a\u001c\u0010@ †\0ŽVŠ\0ý€ø\u001bñËÃÿ\0\u001e<\u001d\u001e³£¸·½‡lzŽ•#†šÊR:\u001e›‘°JH\0\f\u0001èÊê¿Iü+øÁ7„Z=3T/q£±Â·W·Ïqê¾£òô?\u0081ž\tø\u0081âO†úÏö¯…õ»Ý\ný•c’K9Š\t£\u0012$ž\\«÷dŒ¼hÅ\u001c\u0015%\u0006AÅ~ŸþÌ\u007f´†›ûBxf`bK\u000f\u0016ip¬š¦›\u001evìÜ©öˆ²I1\u0016eSžQ\u009dU‰ÜŒà\u001f¨VWÖú•¤WV³%Å¼«¹$ŒåXzƒS×Ê\u001f\u000f>(j>\u0003¸\u0011®nô·lËhÇ§ûH\u007f„þ‡¿­}1áŸ\u0015i¾.Ó\u0012ûL¸\u0013Dxe<<mýÖ\u001d\u008fù\u0014\u0001¯E\u0014P\u0001E\u0014P\u0001E\u0014P\u0001E\u0014P\u0001E\u0014P\u0001E\u0014P\u0001E\u0014P\u0001E\u0014P\u0001E\u0014P\u0001E\u0014P\u0001E\u0014P\u0001E\u0014P\u0001E\u0014P\u0001E\u0014P\u0001E\u0014P\u0001E\u0014P\u0001P^^A§ÚËsu2Ao\u0012–y$8U\u0003¹5Ÿâo\u0015i¾\u0011Ó^ûS¸\u0010Ä8Uêò7÷Tw?ä×Í\u001f\u0011>(j><¸òÎm4¸Û1Z+uÿ\0iÏsú\u000fÔ€lüTøÁ7‹šM3J/o£©Ã·G¸Çsè¾ßŸ ù«ã¯ÇM\u0003à/„?¶5‚×7·\u001bãÓ´¸˜\to%P\t\0ÿ\0\n.å.ä\u001d¡‡\u0005Š«sÿ\0´çí#¦þÏ~\u001b…\u0004+\u007fâÍN\u0003.—¦É\u0090›72}¢R0| ÈËÁË²•\u0004aÙ?0|mñ\u0003ÄŸ\u00125Ÿí_\u0014kwºíú«G\u001c—“\u0017\u0010Ædy<¸—îÇ\u0018y\u001d‚ \n\vœ\u0001š\0µñ7âoˆ>.x¾ïÄ~#»ûMôÿ\0*F€¬Vñ\u0002vÅ\u0012äíEÉã’I$’Ä“ÊÑE\0\u0014QE\0\u0014QE\0\u0014QE\0\u0014QE\0\u0014QE\0\u0014QE\0\u0014QE\0\u0014QE\0\u0014QE\0\u0015=\u008dýÎ—}o{eq-\u009då´‹4\u0017\u00109I\"‘H*êÃ•`@ ŽA\u0015\u0005\u0014\u0001ú!û9þÝZG\u008d\u0012ËÃ¾>k\u007f\u000fëpÚó¯Ü\\$vwò«9%†Õ[vòöpIV`ø)”Ž¾Éðï‰µ/\nj+{¦\\µ´Ã†\u0003•qýÖ\u001d\b¯ÂjúOözýµ¼Gð’;}\u0013ÄI?Š<)\u001aG\u0004\u0010™\u0015nl\u00100É‰Èýâ„$\bœ\u0081ò V@\u000e@?t¾\u001eücÓ<d±Ú]”ÓµnžK7É)ÿ\0`Ÿý\u0004óõ¯C¯ÏŸ‡ÿ\0\u0011¼9ñCÃÉ®ø[U‹VÓ\u001aF‡Î\u008dY\u0019$SÊ:0\f\u008dÈ8`\t\f¤pA>ëà\u001fŽš\u008f‡DvzÀ“TÓÇ\u0002Lþþ1ìOÞ\u001eÇó \u000f¤h¬Ÿ\u000ex«JñeŸÚt»Èî“ø”\u001c:\u001fFSÈ­j\0(¢Š\0(¢Š\0(¢Š\0(¢Š\0(¢Š\0(¢Š\0(¢Š\0(¢Š\0(¢Š\0(¢Š\0(¢Š\0(¢Š\0(¢²|Eâ­/ÂvFëT¼ŽÖ?áRrî}\u0015G$Ð\u0006µyïÄ/ŒZgƒVKKBºŽ¬8òU¾H\u008fûd\u007fè#Ÿ§Zó\u000f\u001e|uÔ|B$³Ñ„š]\u0081àÉŸßÈ=Èû£Øsï^\u0015ñ\u0003â7‡>\u0017ø}õß\u0015jÑi\u001abÊ°ùÒ«;<ŒxTE\u0005\u009d¸'\n\t\u0001Xž\u0001 \u0003¸ñ\u001f‰µ/\u0016j-{©ÜµÄÇ…\u001d\u0015\a÷Tv\u0015ñ‡í!ûtiÞ\ri¼=ðò[=wW’\u0003æk±Ê³ZY³\u0001·ËÆVg\0“×b\u009d ï;•|'ö‚ý¶¼Iñb\u001b½\u000fÃ‘Íá\u007f\nM\u001c–÷\u0011oVº¿Œ¿\u0006G\u0003÷jP\0cC\u008fš@Ìê@\u001f5P\u0004÷×÷:¥õÅííÄ·——24ÓÜNåä–F$³³\u001eY‰$’y$Ô\u0014Q@\u0005\u0014Q@\u0005\u0014Q@\u0005\u0014Q@\u0005\u0014Q@\u0005\u0014Q@\u0005\u0014Q@\u0005\u0014Q@\u0005\u0014Q@\u0005\u0014Q@\u0005\u0014Q@\u0005\u0014Q@\u0005\u0014Q@\u001d\u001f€>#x\u008fáoˆ“\\ð¶«.‘©¬m\tš5WW\u008d‡(èà«¯\0á\u0081\0ª‘È\u0004}íð_öüð¯Œ–ÛMñ´+á-eÊÇöÅËéó1( îå¡Éf8|¢ªdÉÎ+óšŠ\0ýÑÓ5[í\u0006ùn¬n%³ºŒà<d©\u001e û{\u001aö?\u0006þÑ\f»-¼Gm¼tûmªóõdþ«ùWá\aÂ?Úsâ\aÁ\u007f.ßCÕþ×£®\u007fâM©ƒ= Îóò.CEóHÎ|¶]Í\u008dÛ±Šû‹á\u000fíÑà\u000fˆÞ]ž¹/ü!\u001aÃg÷ZœÀÚ?ß?%Î\u0002Œ*\fù‚?™Â®ã@\u001f¬:/ˆ4ï\u0011Z‹\u009d6ö\u001bØ{´M’¾Äu\aØÖ…|M¦ê×š=ÒÜØ]Mi:ô’\u0017*\u007fNÕêž\u0018ý¢u;\u0010\u0090ëV‘ê1\u000e\fðâ9~¤}ÓúP\aÐ´W'á¿Š^\u001añBªÚêQÁpßòït|©3è3Áü\t®²€\n(¢€\n(¢€\n(¢€\n(¢€\n(¢€\n(¢€\n(¢€\n(¢€\n(®OÄŸ\u0014¼7ápëu¨Ç5Âÿ\0Ëµ¯ï$Ï¡Ç\u0003ñ\"€:ÊÏÖuí;Ã¶†çR¼†Î\u001eÍ+c>Àu'ØW…ø£öŠÔ¯ƒÃ¢Z&\u009d\u0019à\\M‰%ú\u0081÷Gë^W©ê×šÍÓ\\ßÝMwpÝd™Ë\u001f§=½¨\u0003Ù|eûD\u0016ßmáËm½¾Ût¼ýU?«~Uãšž­}¯_5ÍõÌ×·R\u001co‘‹\u001f`=\a°¯™>.~Ý\u001e\0øsæYèr\u007fÂo¬.?u¦L\u0005¢}Ãó\\á”åYˆòÄŸ2\u0015mµðïÅßÚsÇÿ\0\u001a<Ë}sVû&ŽØÿ\0‰6˜\f\u0016‡\u001b\u000fÌ¹-'Í\u0018qæ3mbví\a\u0014\u0001ö7ÆOÛ÷Â^\fûV›àÈ?á/Ö\u0013t\u007flÉ\u008fO…ÆõÎÿ\0½6\u0019Pá\0GVÈ”WÀþ>ø‰â?Š\u001e!}sÅ:¬Ú¾¦Ñ¬\"i\u0002ª¢/DDP\u0015\u0017$œ(\u0003,Ç©$ó”P\u0001E\u0014P\u0001E\u0014P\u0001E\u0014P\u0001E\u0014P\u0001E\u0014P\u0001E\u0014P\u0001E\u0014P\u0001E\u0014P\u0001E\u0014P\u0001E\u0014P\u0001E\u0014P\u0001E\u0014P\u0001E\u0014P\u0001E\u0014P\u0001E\u0014P\u0001E\u0014P\a£ü1ý¡¼\u007fð’âÓû\u0003ÄWcN·ùF‘y!žÄ¡\u0090Hëä±Ân`rÉµþfÃ\fšúÿ\0á\u007fü\u0014WÃzäÐÙxßF›Ã2ùH\u001bS³fºµi\u00021‘š0¾djX(U_4üÿ\01\u0001w\u001fÏš(\u0003ö‹Á_\u0012<-ñ\u001aÇí~\u0018ñ\u0006Ÿ­Ä±Ç,‹gp¯$+ %\u0004±çtlp~W\0åH# ×¢ø\u007fâ\u0017ˆ|1µtýRxá^\u0090H|Èÿ\0ï–È\u001f…~\u000fØßÜéwÖ÷¶W\u0012ÙÞ[H³Aq\u0003”’)\u0014‚®¬9V\u0004\u0002\bä\u0011^ãà\u001fÛkâ·€áKwÖ¢ñ5œq²$\u001aüFá\u0081gÝ¼Ì¬³3\u000e@Üä\0qŽ\u0017\0\u001f¶š'í%{\u000eÔÕ´¨n\u0017¡’ÕÌmõÚr\u000fæ+¼Ò~9øOTÚ$¼—O\u0090ÿ\0\rÔD\u007fãË‘ú×ä¯…ÿ\0à¥\u001e\u001bº[\u008føHü\u001dªé…vù?Ùw\u0011^y\u009dwnßäìÇËŒnÎOLsî^\u0019ýª>\u0013x·í?añÞ•\aÙöïþÓv°ÎìãoÚ\u00157ýÓ\u009d¹Ç\u0019ÆF@?J´ÝsNÖ\u00105…ýµâúÁ2¿ò5z¾\u001cVèÊ}Á\u0006·4ß\u001cø‡IÀ´Ö¯¡Qü\u001e{\u0015ÿ\0¾IÅ\0}\u008fE|³gñËÆ\u0016˜\r¨Çr£´Öè\u007fP\u0001­›\u007fÚ;ÄQàKc¦Ê=Dr)ÿ\0Ðÿ\0¥\0}\u001bEx\u001c?´µò\u008fÞèvî\u007fØ\u009d—ú\u001a\u009d\u007fi™?‹Ãª~—„\u007fí:\0÷Z+Â›ö™“ø|:£ëxOþÓ¨&ý¥¯˜~ëC·CþÜìßÐP\a¾Q_9\\~ÑÞ\"“\"+\u001d6!êcv?ú\u001fô¬kÏŽ>0»È]E-”ö†Ý\aêA4\u0001õ5QÔµÍ;GB×÷öÖkë<ÊŸÌ×Èú‡Ž¼Eªd]kwÒ©êž{*ÿ\0ß â°žBÄ³¶ORÌh\u0003ê=[ãŸ„ô½Â;Éu\t\aðÚDOêØ\u001f­pšçí%w.äÒ4¨­ÇA-Û—?]£\0~f¾Bñ7íQð›Â?fûwŽô©þÑ»göcµþ6ã;¾Î\u001fgÞ\u0018ÝŒóŒàãÆ|wÿ\0\u0005\u001cðž‡«5§…ü7}â«hg–)/§¸\u0016\u0011JªÀ$\u0090‚Žå\\dþñ#`6årH\0\u001foxƒâ'ˆ¼M¹oõYÞ\u0016ë\u0004gË\u008f\u001e…W\0þ5ç>6ø‘áo‡\u0016\"ïÄúþŸ¡ÄÑÉ,ky:¤“\bÀ.\"O½#\f¯Ê€œ°\u0018É\u0015ù«ãÿ\0Ûkâ¯\u008f!{tÖaðÍœ‘ª<\u001e\u001fˆÛ³2¾íâff•Xð\u000e×\0\u0081ŒrÙðëûû\u009dRúâööâkËË™\u001aiî.\u001c¼’ÈÄ–vcË1$’O$š\0ûûâwü\u0014[Ãš\u001cÓYx#E›Ä²ùn«©^³ZÛ,…\u0001\u008d–2¾dŠ\u0018\u009dÊÞQù0\tÝ¸|—ñKö˜ø‰ñ†Í´ÿ\0\u0010ëìt\u007f>I—K²…-à\u001bÙ\u0018#ì\u0001¥T1¦Ï5œ®\t\a,Äùu\u0014\0QE\u0014\0QE\u0014\0QE\u0014\0QE\u0014\0QE\u0014\0QE\u0014\0QE\u0014\0QE\u0014\0QE\u0014\0QE\u0014\0QE\u0014\0QE\u0014\0QE\u0014\0QE\u0014\0QE\u0014\0QE\u0014\0QE\u0014\0QE\u0014\0QE\u0014\0QE\u0014\0QE\u0014\u0001«á¿\u0016kž\r¾’÷@Öu\r\u000eòHÌ/q¦ÝIo#FH%\v!\u0004©*§\u001d2\a¥z?†ÿ\0kO‹¾\u0015±’ÖËÇ:„Ñ<†RÚ’E}&H\u0003\u0001çG`¼\u000f”\u001cg'\u0019&¼ŽŠ\0úoCÿ\0‚†|RÒtÈmn ðþµ:nÝ{}e\"Ë&X‘¸C$iÀ8\u0018QÀ\u0019ÉÉ=—†ÿ\0à¥šå­‹¦¿à\u008d?S¼2\u0012“i·ÒYÆ#ÀÂ”u”–Îã»p\u0018 cŒŸŒ¨ \u000f¸¿áæŸõMÿ\0ò»ÿ\0ÜÔ\u007fÃÍ?ê›ÿ\0åwÿ\0¹«áÚ(\u0003î/øy§ýS\u007fü®ÿ\0÷5\u001fðóOú¦ÿ\0ù]ÿ\0îjøvŠ\0û7ÄŸðR½vêÊ5Ð<\u0011§é—b@^]JöKÈÊ`åB\"ÄAÎ\u000eíÄ`\u0011Žr8Ýsþ\n\u0019ñKVÓ&µµƒÃú,ï·mí\u008d“´±á\u0081;DÒHœ\u0081ƒ•<\u0013Œ\u001c\u0011ó%\u0014\u0001ëž$ý­~/xªÅ-/|s¨A\u0012H%\r¦¤V2n\0Œ\u0019 Db¿1ùIÁ88È\u0018ó\u008f\u0012x³\\ñ•ò^ëúÎ¡®^G\u0018….5+©.$XÁ$ g$…Ë1ÇL“ëYTP\u0001E\u0014P\u0001E\u0014P\u0001E\u0014P\u0001E\u0014P\u0001E\u0014P\u0001E\u0014P\u0001E\u0014P\u0001E\u0014P\u0001E\u0014P\u0001E\u0014P\u0001E\u0014P\u0001E\u0014P\aÿÙ";
                    byte[] bytearray = (DetailJourney.Photos.Count == 0) ? System.Text.Encoding.Default.GetBytes(x) : DetailJourney.Photos.ToList()[0].ImageBytes;
                    BitmapImage bitmapimage = ByteArrayToImage(bytearray);
                    Cover = bitmapimage;

                    // get Start date
                    StartDate = DetailJourney.Departure.ToString().Split(' ').First();

                    // get end date
                    EndDate = DetailJourney.Arrival.ToString().Split(' ').First();

                }
                if (SelectedTab.Header == "Thành viên")
                {

                    // get Members List
                    DetailMemberList = new AsyncObservableCollection<dynamic>();
                    foreach (var member in DetailJourney.Members)
                    {
                        dynamic tmp = new
                        {
                            Id = member.Id,
                            Name = member.Name,
                            Phone = member.Phone,
                        };
                        DetailMemberList.Add(member);
                    }

                }
                if (SelectedTab.Header == "Lộ trình")
                {
                    // get Routes list
                    DetailRouteList = new AsyncObservableCollection<dynamic>();
                    foreach (var route in DetailJourney.Routes.OrderBy(t => t.OrderNumber))
                    {
                        dynamic tmp = new
                        {
                            Id = route.OrderNumber,
                            Name = route.Name,
                            Description = route.Description,
                        };
                        DetailRouteList.Add(tmp);
                    }

                }
                if (SelectedTab.Header == "Thu chi")
                {
                    // đọc danh sách thành viên tham gia chuyến đi
                    PaticipantsList = new AsyncObservableCollection<Member>();
                    foreach (var member in DetailJourney.Members)
                    {
                        PaticipantsList.Add(member);
                    }

                    // đọc danh sách các khoản thu
                    InFeesList = new AsyncObservableCollection<dynamic>();
                    foreach (var fee in DetailJourney.Expenses)
                    {
                        dynamic tmp = new
                        {
                            Id = fee.OrderNumber,
                            MemberId = fee.MemberId,
                            Name = fee.Member.Name,
                            Fees = (fee.Fees == null) ? 0 : fee.Fees.Value,
                        };
                        InFeesList.Add(tmp);
                    }

                    // đọc danh sách các khoản chi
                    OutFeesList = new AsyncObservableCollection<dynamic>();
                    foreach (var fee in DetailJourney.Costs)
                    {
                        dynamic tmp = new
                        {
                            Id = fee.OrderNumber,
                            Name = fee.Content,
                            Fees = (fee.Fees == null) ? 0 : fee.Fees.Value,
                        };
                        OutFeesList.Add(tmp);
                    }
                }
                if (SelectedTab.Header == "Tổng kết")
                {

                }
                OnPropertyChanged(); } }
           
        // Thu chi
            //danh sách thành viên tham gia chuyến đi
        private AsyncObservableCollection<Member> _paticipantsList;
        public AsyncObservableCollection<Member> PaticipantsList { get => _paticipantsList; set { _paticipantsList = value; OnPropertyChanged(); } }
            
            // thành viên đc chọn để thu tiền
        private Member _selectedInFeeMember;
        public Member SelectedInFeeMember { get => _selectedInFeeMember; set { _selectedInFeeMember = value; OnPropertyChanged(); } }

            // Danh sách thành viên đã đóng tiền và số tiền đã đóng
        private AsyncObservableCollection<dynamic> _inFeesList;
        public AsyncObservableCollection<dynamic> InFeesList { get => _inFeesList; set { _inFeesList = value; OnPropertyChanged(); } }

            // Số tiền thu vào
        private string _inFee;
        public string InFee { get => _inFee; set { _inFee = value; OnPropertyChanged(); } }

            // danh sách khoản chi
        private AsyncObservableCollection<dynamic> _outFeesList;
        public AsyncObservableCollection<dynamic> OutFeesList { get => _outFeesList; set { _outFeesList = value; OnPropertyChanged(); } }
            
            // Tên khoản chi mới
        private string _outFeeContent;
        public string OutFeeContent { get => _outFeeContent; set { _outFeeContent = value; OnPropertyChanged(); } }

            // Số tiền chi ra
        private string _outFee;
        public string OutFee { get => _outFee; set { _outFee = value; OnPropertyChanged(); } }

            // Khoản chi đã chọn dưới danh sách
        private dynamic _selectedOutFee;
        public dynamic SelectedOutFee { get => _selectedOutFee; set { _selectedOutFee = value;
                OutFeeContent = (SelectedOutFee == null) ? null : SelectedOutFee.Name;
                OnPropertyChanged(); } }
        //Commands
        public ICommand CloseWindowCommand { get; set; }
        public ICommand DeleteParticipantCommand { get; set; }
        public ICommand AddParticipantCommand { get; set; }
        public ICommand AddRouteCommand { get; set; }
        public ICommand DeleteRouteCommand { get; set; }
        public ICommand AddInFeeCommand { get; set; }
        public ICommand DeleteInFeeCommand { get; set; }
        public ICommand AddOutFeeCommand { get; set; }
        public ICommand DeleteOutFeeCommand { get; set; }
        public DetailUCViewModel()
        {
            AddOrUpdateRouteContent = "THÊM";
            var value = ConfigurationManager.AppSettings["DetailTripId"];
            int DetailTripId = int.Parse(value);
            int JourneyId = DetailTripId;
            DetailJourney = DataProvider.Ins.DB.Journeys.Where(x => x.Id == JourneyId).FirstOrDefault();

            DeleteParticipantCommand = new RelayCommand<Member>((param) => { return true; }, (param) => {
                if (Global.GetInstance().ConfirmMessageDelete() == true)
                {
                    foreach (var expense in DataProvider.Ins.DB.Expenses.Where(x => x.JourneyId == DetailJourney.Id && x.MemberId == param.Id))
                    {
                        DataProvider.Ins.DB.Expenses.Remove(expense);
                    }
                    DataProvider.Ins.DB.Journeys.Find(DetailJourney.Id).Members.Remove(param);
                    DataProvider.Ins.DB.Members.Find(param.Id).Journeys.Remove(DetailJourney);
                    DataProvider.Ins.DB.SaveChanges();
                    MemberList.Add(param);
                    DetailMemberList.Remove(param);
                }
            });

            AddParticipantCommand = new RelayCommand<object>((param) => { return true; }, (param) => {
                if (SelectedMember == null)
                {
                    MessageBox.Show("Please select a member to add to this journey");
                    return;
                }
                dynamic tmp = new
                {
                    Id = SelectedMember.Id,
                    Name = SelectedMember.Name,
                    Phone = SelectedMember.Phone,
                };
                DetailMemberList.Add(tmp);
                DataProvider.Ins.DB.Journeys.Find(DetailJourney.Id).Members.Add(SelectedMember);
                DataProvider.Ins.DB.Members.Find(SelectedMember.Id).Journeys.Add(DetailJourney);
                MemberList.Remove(SelectedMember);
                DataProvider.Ins.DB.SaveChanges();
            });

            AddRouteCommand = new RelayCommand<object>((param) => { return true; }, (param) => {
                if (RouteName == null || RouteName == "")
                {
                    MessageBox.Show("Please enter route name");
                    return;
                }
                if (SelectedRoute == null)
                {
                    DataProvider.Ins.DB.Routes.Add(new Route { 
                        JourneyId = DetailJourney.Id,
                        OrderNumber = DetailJourney.Routes.Max(x => x.OrderNumber) + 1,
                        Name = RouteName,
                        Description=RouteDescription,
                    });
                    DataProvider.Ins.DB.SaveChanges();
                    dynamic tmp = new
                    {
                        Id = DetailJourney.Routes.Max(x => x.OrderNumber),
                        Name = RouteName,
                        Description = RouteDescription,
                    };
                    DetailRouteList.Add(tmp);
                }
                else // update exist route
                {
                    int id = SelectedRoute.Id;
                    Route tmp = DataProvider.Ins.DB.Routes.Find(DetailJourney.Id, id);
                    tmp.Name = RouteName;
                    tmp.Description = RouteDescription;
                    DataProvider.Ins.DB.SaveChanges();
                    DetailRouteList = new AsyncObservableCollection<dynamic>();
                    foreach (var route in DetailJourney.Routes.OrderBy(t => t.OrderNumber))
                    {
                        dynamic tmp2 = new
                        {
                            Id = route.OrderNumber,
                            Name = route.Name,
                            Description = route.Description,
                        };
                        DetailRouteList.Add(tmp2);
                    }
                }
                SelectedRoute = null;
            });
            
            DeleteRouteCommand = new RelayCommand<dynamic>((param) => { return true; }, (param) => {
                if (Global.GetInstance().ConfirmMessageDelete() == true)
                {
                    int id = param.Id;
                    Route deleteroute = DataProvider.Ins.DB.Routes.Find(DetailJourney.Id, id);
                    DataProvider.Ins.DB.Routes.Remove(deleteroute);
                    DataProvider.Ins.DB.SaveChanges();

                    DetailRouteList.Remove(param);
                }
            });

            AddInFeeCommand = new RelayCommand<dynamic>((param) => { return true; }, (param) => {
                if (SelectedInFeeMember == null)
                {
                    MessageBox.Show("Hãy chọn thành viên trước");
                    return;
                }
                if (InFee == null || InFee == "")
                {
                    MessageBox.Show("Hãy nhập số tiền");
                    return;
                }
                if (System.Text.RegularExpressions.Regex.IsMatch(InFee, "[^0-9]"))
                {
                    MessageBox.Show("Số tiền chỉ có thể nhập số");
                    InFee = null;
                    return;
                }
                Expense newexpense = new Expense
                {
                    JourneyId = DetailJourney.Id,
                    MemberId = SelectedInFeeMember.Id,
                    OrderNumber = DataProvider.Ins.DB.Expenses.Max(x => x.OrderNumber) + 1,
                    Fees = int.Parse(InFee),
                };
                DataProvider.Ins.DB.Expenses.Add(newexpense);
                DataProvider.Ins.DB.SaveChanges();
                dynamic tmp = new
                {
                    Id = newexpense.OrderNumber,
                    MemberId =  newexpense.MemberId,
                    Name = newexpense.Member.Name,
                    Fees = newexpense.Fees.Value,
                };
                InFeesList.Add(tmp);

                SelectedInFeeMember = null;
                InFee = null;
            });

            DeleteInFeeCommand = new RelayCommand<dynamic>((param) => { return true; }, (param) => {
                if (Global.GetInstance().ConfirmMessageDelete() == true)
                {
                    Expense deleteExpense = DataProvider.Ins.DB.Expenses.Find(DetailJourney.Id, param.Id, param.MemberId);
                    DataProvider.Ins.DB.Expenses.Remove(deleteExpense);
                    DataProvider.Ins.DB.SaveChanges();
                    InFeesList.Remove(param);
                }
            });

            AddOutFeeCommand = new RelayCommand<dynamic>((param) => { return true; }, (param) => {
                if (OutFeeContent == null || OutFeeContent == "")
                {
                    MessageBox.Show("Hãy nhập khoản chi trước");
                    OutFeeContent = null;
                    return;
                }
                if (OutFee == null || OutFee == "")
                {
                    MessageBox.Show("Hãy nhập số tiền");
                    return;
                }
                if (System.Text.RegularExpressions.Regex.IsMatch(OutFee, "[^0-9]"))
                {
                    MessageBox.Show("Số tiền chỉ có thể nhập số");
                    OutFee = null;
                    return;
                }
                if (DetailJourney.Costs.Where(x => x.Content.ToUpper() == OutFeeContent.ToUpper()).Count() != 0)
                {
                    int id = DetailJourney.Costs.First(x => x.Content.ToUpper() == OutFeeContent.ToUpper()).OrderNumber;
                    Cost tmpCost = DataProvider.Ins.DB.Costs.Find(DetailJourney.Id, id);
                    tmpCost.Fees = ((tmpCost.Fees == null) ? 0 : tmpCost.Fees.Value) + int.Parse(OutFee);
                    OutFeesList = new AsyncObservableCollection<dynamic>();
                    foreach (var fee in DetailJourney.Costs)
                    {
                        dynamic tmp = new
                        {
                            Id = fee.OrderNumber,
                            Name = fee.Content,
                            Fees = (fee.Fees == null) ? 0 : fee.Fees.Value,
                        };
                        OutFeesList.Add(tmp);
                    }
                }
                else
                {
                    Cost newCost = new Cost
                    {
                        JourneyId = DetailJourney.Id,
                        OrderNumber = DataProvider.Ins.DB.Costs.Max(x => x.OrderNumber) + 1,
                        Content = OutFeeContent,
                        Fees = int.Parse(OutFee),
                    };
                    DataProvider.Ins.DB.Costs.Add(newCost);
                    dynamic tmp = new
                    {
                        Id = newCost.OrderNumber,
                        Name = newCost.Content,
                        Fees = newCost.Fees.Value,
                    };
                    OutFeesList.Add(tmp);
                }
                DataProvider.Ins.DB.SaveChanges();
                OutFeeContent = null;
                OutFee = null;
            });

            DeleteOutFeeCommand = new RelayCommand<dynamic>((param) => { return true; }, (param) => {
                if (Global.GetInstance().ConfirmMessageDelete() == true)
                {
                    Cost deleteCost = DetailJourney.Costs.First(x => x.OrderNumber == param.Id);
                    DataProvider.Ins.DB.Costs.Remove(deleteCost);
                    DataProvider.Ins.DB.SaveChanges();
                    OutFeesList.Remove(param);
                }
            });
        }



        public BitmapImage ByteArrayToImage(byte[] imageData)
        {
            if (imageData == null || imageData.Length == 0) return null;
            var image = new BitmapImage();
            using (var mem = new MemoryStream(imageData))
            {
                mem.Position = 0;
                image.BeginInit();
                image.CreateOptions = BitmapCreateOptions.PreservePixelFormat;
                image.CacheOption = BitmapCacheOption.OnLoad;
                image.UriSource = null;
                image.StreamSource = mem;
                image.EndInit();
            }
            image.Freeze();
            return image;
        }
    }
}
